Repository: jojoji54/learnSwift
Catalog: lib/l10n/app_*.arb
Languages: es, zh

# exercise13CorrectContent
source: Great! You''ve successfully declared constants in Swift. Explanation: 1. Declared constants using `let`. 2. Assigned values of different data types (numbers, strings, booleans). 3. Printed their values to the console.
es: ¡Genial! Has declarado constantes en Swift. Explicación: 1. Declaraste constantes usando `let`. 2. Asignaste valores de diferentes tipos de datos (números, cadenas, booleanos). 3. Imprimiste sus valores en la consola.
zh: 太棒了！您在 Swift 中正确地声明了常量。 说明： 1. 使用 `let` 声明了常量。 2. 为常量赋予了不同类型的值（数字、字符串、布尔值）。 3. 使用 `print()` 打印了它们的值。

# exercise13Hint1Content
source: Start by using the `let` keyword to declare constants.
es: Comienza usando la palabra clave `let` para declarar constantes.
zh: 从使用关键字 `let` 声明常量开始。

# exercise13Hint2Content
source: Assign values of different types (e.g., a number, a string, a boolean) to the constants.
es: Asigna valores de diferentes tipos (por ejemplo, un número, una cadena, un booleano) a las constantes.
zh: 为常量赋予不同类型的值（例如，一个数字，一个字符串，一个布尔值）。

# exercise13SolutionContent
source: The correct answer is: let pi = 3.14159 let name = "John" let isActive = true print(pi) print(name) print(isActive)
es: La respuesta correcta es: let pi = 3.14159 let name = "John" let isActive = true print(pi) print(name) print(isActive)
zh: 正确答案是： let pi = 3.14159 let name = "John" let isActive = true print(pi) print(name) print(isActive)

# exercise14InstructionsContent
source: Combine concepts: create a constant for pi, write a function to calculate circle areas, use an array of radii, and print results.
es: Combina conceptos: crea una constante para pi, escribe una función para calcular áreas de círculos, usa un array de radios e imprime los resultados.
zh: 结合概念：创建一个用于 pi 的常量，编写一个函数来计算圆的面积，使用一个数组存储半径并打印结果。

# exercise14CorrectContent
source: Great! You''ve successfully combined multiple Swift concepts. Explanation: 1. Declared a constant for the value of pi. 2. Created a function to calculate the area of a circle. 3. Used an array to store radii. 4. Stored the calculated areas in a new array and printed the results.
es: ¡Genial! Has combinado varios conceptos de Swift. Explicación: 1. Declaraste una constante para el valor de pi. 2. Creaste una función para calcular el área de un círculo. 3. Usaste un array para almacenar los radios. 4. Guardaste las áreas calculadas en un nuevo array e imprimiste los resultados.
zh: 太棒了！您结合了 Swift 的多个概念。 说明： 1. 声明了一个常量来表示 pi 的值。 2. 创建了一个函数来计算圆的面积。 3. 使用了一个数组存储半径。 4. 将计算出的面积存储在一个新的数组中，并打印了结果。

# exercise14Hint1Content
source: Declare a constant for the value of pi using `let`.
es: Declara una constante para el valor de pi usando `let`.
zh: 使用 `let` 声明一个表示 pi 的常量。

# exercise14Hint2Content
source: Write a function that calculates the area of a circle using a radius.
es: Escribe una función que calcule el área de un círculo usando un radio.
zh: 编写一个函数，使用给定的半径计算圆的面积。

# exercise14SolutionContent
source: The correct answer is: let pi = 3.14159 func calculateCircleArea(radius: Double) -> Double @ return pi * radius * radius & let radii = [3.0, 4.5, 6.7] var areas = [Double]() for radius in radii @ areas.append(calculateCircleArea(radius: radius)) & print(areas)
es: La respuesta correcta es: let pi = 3.14159 func calculateCircleArea(radius: Double) -> Double @ return pi * radius * radius & let radii = [3.0, 4.5, 6.7] var areas = [Double]() for radius in radii @ areas.append(calculateCircleArea(radius: radius)) & print(areas)
zh: 正确答案是： let pi = 3.14159 func calculateCircleArea(radius: Double) -> Double @ return pi * radius * radius & let radii = [3.0, 4.5, 6.7] var areas = [Double]() for radius in radii @ areas.append(calculateCircleArea(radius: radius)) & print(areas)

# exercise15InstructionsContent
source: Write two functions for temperature conversion: Celsius to Fahrenheit and Fahrenheit to Celsius. Use constants for temperatures and print the results.
es: Escribe dos funciones para convertir temperaturas: de Celsius a Fahrenheit y de Fahrenheit a Celsius. Usa constantes para las temperaturas e imprime los resultados.
zh: 编写两个函数来转换温度：从摄氏度到华氏度，以及从华氏度到摄氏度。使用常量存储温度并打印结果。

# exercise15CorrectContent
source: Fantastic! You''ve successfully created a temperature converter. Explanation: 1. Defined functions for converting Celsius to Fahrenheit and vice versa. 2. Declared constants for initial temperatures. 3. Printed the results of the conversions.
es: ¡Fantástico! Has creado un conversor de temperaturas. Explicación: 1. Definiste funciones para convertir Celsius a Fahrenheit y viceversa. 2. Declaraste constantes para las temperaturas iniciales. 3. Imprimiste los resultados de las conversiones.
zh: 很棒！您已经创建了一个温度转换器。 说明： 1. 定义了用于从摄氏度转换到华氏度以及从华氏度转换到摄氏度的函数。 2. 声明了初始温度的常量。 3. 打印了转换结果。

# exercise15Hint1Content
source: Define a function for Celsius to Fahrenheit using the formula `(Celsius * 9 / 5) + 32`.
es: Define una función para Celsius a Fahrenheit usando la fórmula `(Celsius * 9 / 5) + 32`.
zh: 定义一个从摄氏度到华氏度的函数，使用公式 `(Celsius * 9 / 5) + 32`。

# exercise15Hint2Content
source: Define a function for Fahrenheit to Celsius using the formula `(Fahrenheit - 32) * 5 / 9`.
es: Define una función para Fahrenheit a Celsius usando la fórmula `(Fahrenheit - 32) * 5 / 9`.
zh: 定义一个从华氏度到摄氏度的函数，使用公式 `(Fahrenheit - 32) * 5 / 9`。

# exercise15SolutionContent
source: The correct answer is: func convertToFahrenheit(celsius: Double) -> Double @ return (celsius * 9 / 5) + 32 & func convertToCelsius(fahrenheit: Double) -> Double @ return (fahrenheit - 32) * 5 / 9 & let tempInCelsius = 25.0 let tempInFahrenheit = 77.0 print(convertToFahrenheit(celsius: tempInCelsius)) print(convertToCelsius(fahrenheit: tempInFahrenheit))
es: La respuesta correcta es: func convertToFahrenheit(celsius: Double) -> Double @ return (celsius * 9 / 5) + 32 & func convertToCelsius(fahrenheit: Double) -> Double @ return (fahrenheit - 32) * 5 / 9 & let tempInCelsius = 25.0 let tempInFahrenheit = 77.0 print(convertToFahrenheit(celsius: tempInCelsius)) print(convertToCelsius(fahrenheit: tempInFahrenheit))
zh: 正确答案是： func convertToFahrenheit(celsius: Double) -> Double @ return (celsius * 9 / 5) + 32 & func convertToCelsius(fahrenheit: Double) -> Double @ return (fahrenheit - 32) * 5 / 9 & let tempInCelsius = 25.0 let tempInFahrenheit = 77.0 print(convertToFahrenheit(celsius: tempInCelsius)) print(convertToCelsius(fahrenheit: tempInFahrenheit))

# exercise3Hint1Content
source: Remember to use the `print()` function to display a message in the console. For example: ```swift print("Hello, World!") ```
es: Recuerda usar la función `print()` para mostrar un mensaje en la consola. Por ejemplo: ```swift print("Hola, Mundo!") ```
zh: 记住使用 `print()` 函数在控制台打印消息。 例如： ```swift print("你好，世界！") ```

# exercise3Hint2Content
source: Make sure your message is enclosed in double quotes. Example: ```swift print("Swift is fun!") ```
es: Asegúrate de que tu mensaje esté entre comillas dobles. Ejemplo: ```swift print("¡Swift es divertido!") ```
zh: 确保您的消息在双引号内。 示例： ```swift print("Swift 很有趣！") ```

# unlockExerciseTitle
source: Unlock Exercise?
es: ¿Desbloquear ejercicio?
zh: 解锁练习？

# unlockExerciseContent
source: Do you want to unlock the exercise "{exerciseName}"? You can do so in the following ways:
es: ¿Quieres desbloquear el ejercicio "{exerciseName}"? Puedes hacerlo de las siguientes maneras:
zh: 您是否希望解锁练习 "{exerciseName}"？可以通过以下方式完成：

source: Cancel
es: Cancelar
zh: 取消

# buyExercise
source: Buy this exercise
es: Comprar este ejercicio
zh: 购买此练习

# buyAllExercises
source: Unlock all exercises
es: Desbloquear todos los ejercicios
zh: 解锁所有练习

source: Restore purchases
es: Restaurar compras
zh: 恢复购买

# purchaseUnavailable
source: Purchases are not available at the moment.
es: Las compras no están disponibles en este momento.
zh: 目前无法进行购买。

# purchaseInitiated
source: The purchase has been initiated.
es: La compra se ha iniciado.
zh: 购买已开始。

source: Product not found.
es: Producto no encontrado.
zh: 未找到产品。

# restoreSuccess
source: Purchases restored successfully!
es: ¡Compras restauradas con éxito!
zh: 购买恢复成功！

# restoreError
source: An error occurred during the restoration.
es: Ocurrió un error durante la restauración.
zh: 恢复期间发生错误。

source: No purchases to restore.
es: No hay compras para restaurar.
zh: 没有可恢复的购买。

# unexpectedRestoreError
source: Unexpected error during restoration.
es: Error inesperado durante la restauración.
zh: 恢复期间发生意外错误。

# exercise151InstructionsContent
source: Welcome to Boolean Basics! 🎉 Your task: 1. Declare a variable of type boolean using the `var` keyword. 2. Assign it the value `true` or `false`. Example: ```swift var isSwiftFun = true ```
es: ¡Bienvenido a los conceptos básicos de Boolean! 🎉 Tu tarea: 1. Declara una variable de tipo boolean usando la palabra clave `var`. 2. Asígnale el valor `true` o `false`. Ejemplo: ```swift var isSwiftFun = true ```
zh: 欢迎来到 Boolean 的基础概念！🎉 您的任务： 1. 使用关键字 `var` 声明一个布尔类型的变量。 2. 为其赋值 `true` 或 `false`。 示例： ```swift var isSwiftFun = true ```

# exercise151SolutionContent
source: The correct solution is: ```swift var isSwiftFun = true ```
es: La solución correcta es: ```swift var isSwiftFun = true ```
zh: 正确答案是： ```swift var isSwiftFun = true ```

# exercise151Hint1Content
source: Use the `var` keyword to declare a variable. Assign it a boolean value like `true` or `false`.
es: Usa la palabra clave `var` para declarar una variable. Asígnale un valor booleano como `true` o `false`.
zh: 使用关键字 `var` 声明一个变量。为其赋值一个布尔值，比如 `true` 或 `false`。

# exercise151Hint2Content
source: A correct example is: ```swift var isSwiftFun = true ```
es: Un ejemplo correcto es: ```swift var isSwiftFun = true ```
zh: 一个正确的示例是： ```swift var isSwiftFun = true ```

# booleanExplanation
source: Great! You''ve successfully combined boolean variables using logical operators. Explanation: - The `&&` operator checks if both conditions are true. - The `||` operator checks if at least one condition is true. By using these operators, you can make decisions based on multiple conditions.
es: ¡Genial! Has combinado correctamente las variables booleanas utilizando operadores lógicos. Explicación: - El operador `&&` verifica si ambas condiciones son verdaderas. - El operador `||` verifica si al menos una condición es verdadera. Al usar estos operadores, puedes tomar decisiones basadas en múltiples condiciones.
zh: 太棒了！您使用逻辑运算符正确地组合了布尔变量。 说明： - 运算符 `&&` 检查两个条件是否都为真。 - 运算符 `||` 检查是否至少有一个条件为真。 使用这些运算符可以根据多个条件做出决策。

# hint1Boolean
source: Start by declaring two boolean variables: `var isSunny = true` and `var isWeekend = false`.
es: Comienza declarando dos variables booleanas: `var isSunny = true` y `var isWeekend = false`.
zh: 从声明两个布尔变量开始：`var isSunny = true` 和 `var isWeekend = false`。

# hint2Boolean
source: Use the `&&` operator to check if both conditions are true. For example: `var goToBeach = isSunny && isWeekend`.
es: Usa el operador `&&` para verificar si ambas condiciones son verdaderas. Por ejemplo: `var goToBeach = isSunny && isWeekend`.
zh: 使用运算符 `&&` 检查两个条件是否都为真。例如：`var goToBeach = isSunny && isWeekend`。

# exerciseInstructionsBoolean
source: Welcome to Boolean Operations! 🎉 Your task: 1. Declare two boolean variables: `isSunny` and `isWeekend`. 2. Combine them using `&&` or `||` and assign the result to `goToBeach`. 3. Print the result.
es: ¡Bienvenido a las Operaciones Booleanas! 🎉 Tu tarea: 1. Declara dos variables booleanas: `isSunny` y `isWeekend`. 2. Combínalas usando `&&` o `||` y asigna el resultado a `goToBeach`. 3. Imprime el resultado.
zh: 欢迎来到布尔运算！🎉 您的任务： 1. 声明两个布尔变量：`isSunny` 和 `isWeekend`。 2. 使用 `&&` 或 `||` 将它们组合，并将结果赋值给 `goToBeach`。 3. 打印结果。

# exercise16SolutionContent
source: The correct solution is: ```swift var isSunny = true; var isWeekend = false; var goToBeach = isSunny && isWeekend; print(goToBeach); ```
es: La solución correcta es: ```swift var isSunny = true; var isWeekend = false; var goToBeach = isSunny && isWeekend; print(goToBeach); ```
zh: 正确答案是： ```swift var isSunny = true; var isWeekend = false; var goToBeach = isSunny && isWeekend; print(goToBeach); ```

source: Example
es: Ejemplo
zh: 示例

# booleanComparisonExplanation
source: Great! You''ve successfully used boolean comparisons in Swift. Explanation: - `!isHot` checks if `isHot` is `false`. - `!isCold` checks if `isCold` is `false`. - Combining these conditions using `&&` determines if the environment is comfortable. This exercise demonstrates how to use logical operators with comparisons to evaluate complex conditions.
es: ¡Genial! Has usado comparaciones booleanas correctamente en Swift. Explicación: - `!isHot` verifica si `isHot` es `false`. - `!isCold` verifica si `isCold` es `false`. - Combinando estas condiciones con `&&` determina si el ambiente es cómodo. Este ejercicio demuestra cómo usar operadores lógicos con comparaciones para evaluar condiciones complejas.
zh: 太棒了！您在 Swift 中正确地使用了布尔比较。 说明： - `!isHot` 检查 `isHot` 是否为 `false`。 - `!isCold` 检查 `isCold` 是否为 `false`。 - 将这些条件与 `&&` 结合起来可以判断环境是否舒适。 此练习展示了如何使用逻辑运算符进行复杂条件的评估。

# hint1BooleanComparison
source: Declare two boolean variables: `isHot` and `isCold`. Assign them values like `true` or `false`.
es: Declara dos variables booleanas: `isHot` y `isCold`. Asígnales valores como `true` o `false`.
zh: 声明两个布尔变量：`isHot` 和 `isCold`。为它们赋值 `true` 或 `false`。

# hint2BooleanComparison
source: Use the `!` operator to invert a boolean value, e.g., `!isHot` checks if `isHot` is `false`.
es: Usa el operador `!` para invertir un valor booleano, por ejemplo, `!isHot` verifica si `isHot` es `false`.
zh: 使用运算符 `!` 来反转布尔值，例如，`!isHot` 检查 `isHot` 是否为 `false`。

# exerciseInstructionsBooleanComparison
source: Welcome to Boolean Comparisons! 🎉 Your task: 1. Declare two boolean variables: `isHot` and `isCold`. 2. Combine them using the `!` operator and the `&&` operator to determine if `isComfortable` is `true`. 3. Print the result.
es: ¡Bienvenido a las Comparaciones Booleanas! 🎉 Tu tarea: 1. Declara dos variables booleanas: `isHot` y `isCold`. 2. Combínalas usando el operador `!` y el operador `&&` para determinar si `isComfortable` es `true`. 3. Imprime el resultado.
zh: 欢迎来到布尔比较！🎉 您的任务： 1. 声明两个布尔变量：`isHot` 和 `isCold`。 2. 使用运算符 `!` 和 `&&` 将它们组合，确定 `isComfortable` 是否为 `true`。 3. 打印结果。

# exercise17SolutionContent
source: The correct solution is: ```swift var isHot = false; var isCold = false; var isComfortable = !isHot && !isCold; print(isComfortable); ```
es: La solución correcta es: ```swift var isHot = false; var isCold = false; var isComfortable = !isHot && !isCold; print(isComfortable); ```
zh: 正确答案是： ```swift var isHot = false; var isCold = false; var isComfortable = !isHot && !isCold; print(isComfortable); ```

# booleanWalkingExplanation
source: Great! You''ve successfully used logical operators to combine boolean values in Swift. Explanation: - `isSunny` checks if it is sunny. - `hasUmbrella` checks if you have an umbrella. - `canGoWalking` combines these two values using the `||` operator to decide if you can go walking. Example: ```swift var isSunny = true var hasUmbrella = false var canGoWalking = isSunny || hasUmbrella print(canGoWalking) // true ```
es: ¡Genial! Has usado operadores lógicos para combinar valores booleanos en Swift. Explicación: - `isSunny` verifica si está soleado. - `hasUmbrella` verifica si tienes un paraguas. - `canGoWalking` combina estos dos valores usando el operador `||` para decidir si puedes salir a caminar. Ejemplo: ```swift var isSunny = true var hasUmbrella = false var canGoWalking = isSunny || hasUmbrella print(canGoWalking) // true ```
zh: 太棒了！您在 Swift 中正确地使用了逻辑运算符组合布尔值。 说明： - `isSunny` 检查是否晴天。 - `hasUmbrella` 检查是否有雨伞。 - `canGoWalking` 使用运算符 `||` 组合这两个值，以决定是否可以外出散步。 示例： ```swift var isSunny = true var hasUmbrella = false var canGoWalking = isSunny || hasUmbrella print(canGoWalking) // true ```

# hint1BooleanWalking
source: Use the `var` keyword to declare the variables. Assign boolean values like `true` or `false`.
es: Usa la palabra clave `var` para declarar las variables. Asigna valores booleanos como `true` o `false`.
zh: 使用关键字 `var` 声明变量。赋值布尔值，比如 `true` 或 `false`。

# hint2BooleanWalking
source: Combine the boolean values using the `||` operator. For example: ```swift var canGoWalking = isSunny || hasUmbrella ```
es: Combina los valores booleanos usando el operador `||`. Por ejemplo: ```swift var canGoWalking = isSunny || hasUmbrella ```
zh: 使用运算符 `||` 组合布尔值。例如： ```swift var canGoWalking = isSunny || hasUmbrella ```

# exerciseInstructionsBooleanWalking
source: Welcome to Boolean Operations! 🎉 Your task: 1. Declare two boolean variables: `isSunny` and `hasUmbrella`. 2. Combine them using the `||` operator to decide if you can go walking. Example: ```swift var isSunny = true var hasUmbrella = false var canGoWalking = isSunny || hasUmbrella print(canGoWalking) ```
es: ¡Bienvenido a Operadores Booleanos! 🎉 Tu tarea: 1. Declara dos variables booleanas: `isSunny` y `hasUmbrella`. 2. Combínalas usando el operador `||` para decidir si puedes salir a caminar. Ejemplo: ```swift var isSunny = true var hasUmbrella = false var canGoWalking = isSunny || hasUmbrella print(canGoWalking) ```
zh: 欢迎使用布尔运算符！🎉 您的任务： 1. 声明两个布尔变量：`isSunny` 和 `hasUmbrella`。 2. 使用运算符 `||` 组合它们，以决定是否可以外出散步。 示例： ```swift var isSunny = true var hasUmbrella = false var canGoWalking = isSunny || hasUmbrella print(canGoWalking) ```

# exercise18SolutionContent
source: The correct solution is: ```swift var isSunny = true var hasUmbrella = false var canGoWalking = isSunny || hasUmbrella print(canGoWalking) ```
es: La solución correcta es: ```swift var isSunny = true var hasUmbrella = false var canGoWalking = isSunny || hasUmbrella print(canGoWalking) ```
zh: 正确答案是： ```swift var isSunny = true var hasUmbrella = false var canGoWalking = isSunny || hasUmbrella print(canGoWalking) ```

# logicalOperatorsExplanation
source: Great! You''ve successfully used logical operators to decide if you can go outside. Explanation: - `isRaining` checks if it is raining. - `haveUmbrella` checks if you have an umbrella. - `canGoOutside` combines these two values using the `||` operator to determine if you can go outside. Example: ```swift var isRaining = true var haveUmbrella = true var canGoOutside = !isRaining || haveUmbrella print(canGoOutside) ```
es: ¡Genial! Has utilizado operadores lógicos correctamente para decidir si puedes salir. Explicación: - `isRaining` verifica si está lloviendo. - `haveUmbrella` verifica si tienes un paraguas. - `canGoOutside` combina estos valores usando el operador `||` para determinar si puedes salir. Ejemplo: ```swift var isRaining = true var haveUmbrella = true var canGoOutside = !isRaining || haveUmbrella print(canGoOutside) ```
zh: 太棒了！您正确地使用了逻辑运算符来判断是否可以外出。 说明： - `isRaining` 检查是否在下雨。 - `haveUmbrella` 检查是否有雨伞。 - `canGoOutside` 使用运算符 `||` 组合这些值，以确定是否可以外出。 示例： ```swift var isRaining = true var haveUmbrella = true var canGoOutside = !isRaining || haveUmbrella print(canGoOutside) ```

# hint1LogicalOperators
source: Declare two variables: `isRaining` and `haveUmbrella`. Assign them boolean values like `true` or `false`.
es: Declara dos variables: `isRaining` y `haveUmbrella`. Asígnales valores booleanos como `true` o `false`.
zh: 声明两个变量：`isRaining` 和 `haveUmbrella`。为它们赋值布尔值，比如 `true` 或 `false`。

# hint2LogicalOperators
source: Combine the variables using the logical operators `&&` and `||`.
es: Combina las variables usando los operadores lógicos `&&` y `||`.
zh: 使用逻辑运算符 `&&` 和 `||` 组合变量。

# exerciseInstructionsLogicalOperators
source: Welcome to the Logical Operators Exercise! 🎉 Your task: 1. Declare two boolean variables: `isRaining` and `haveUmbrella`. 2. Use the `||` operator to decide if you can go outside. Example: ```swift var isRaining = true var haveUmbrella = true var canGoOutside = !isRaining || haveUmbrella ```
es: ¡Bienvenido al ejercicio de Operadores Lógicos! 🎉 Tu tarea: 1. Declara dos variables booleanas: `isRaining` y `haveUmbrella`. 2. Usa el operador `||` para decidir si puedes salir. Ejemplo: ```swift var isRaining = true var haveUmbrella = true var canGoOutside = !isRaining || haveUmbrella ```
zh: 欢迎来到逻辑运算符练习！🎉 您的任务： 1. 声明两个布尔变量：`isRaining` 和 `haveUmbrella`。 2. 使用运算符 `||` 决定是否可以外出。 示例： ```swift var isRaining = true var haveUmbrella = true var canGoOutside = !isRaining || haveUmbrella ```

# exercise19SolutionContent
source: The correct solution is: ```swift var isRaining = true; var haveUmbrella = true; var canGoOutside = !isRaining || haveUmbrella; print(canGoOutside); ```
es: La solución correcta es: ```swift var isRaining = true; var haveUmbrella = true; var canGoOutside = !isRaining || haveUmbrella; print(canGoOutside); ```
zh: 正确答案是： ```swift var isRaining = true; var haveUmbrella = true; var canGoOutside = !isRaining || haveUmbrella; print(canGoOutside); ```

# logicalOrExplanation
source: Great! You''ve successfully used the logical OR operator in Swift. Explanation: - The `||` operator returns `true` if **either** of the conditions is true. - Example: `let isSunny = true || false` evaluates to `true` because one of the conditions is true.
es: ¡Genial! Has usado correctamente el operador lógico OR en Swift. Explicación: - El operador `||` devuelve `true` si **alguna** de las condiciones es verdadera. - Ejemplo: `let isSunny = true || false` evalúa como `true` porque una de las condiciones es verdadera.
zh: 太棒了！您在 Swift 中正确地使用了逻辑 OR 运算符。 说明： - 运算符 `||` 如果 **任意一个** 条件为真，就返回 `true`。 - 示例：`let isSunny = true || false` 的计算结果是 `true`，因为其中一个条件为真。

# hint1LogicalOr
source: Use the `||` operator to check if **either** of two conditions is true.
es: Usa el operador `||` para verificar si **alguna** de las dos condiciones es verdadera.
zh: 使用运算符 `||` 来检查 **任意两个** 条件是否为真。

# hint2LogicalOr
source: An example syntax is: ```swift let isSunny = true || false ```
es: Una sintaxis de ejemplo es: ```swift let isSunny = true || false ```
zh: 示例语法： ```swift let isSunny = true || false ```

# exerciseInstructionsLogicalOr
source: Welcome to Logical OR Operator Basics! 🎉 Your task: 1. Use the `let` keyword to declare a constant. 2. Assign it a value that uses the logical OR operator (`||`). Example: ```swift let isSunny = true || false ```
es: ¡Bienvenido a los fundamentos del operador lógico OR! 🎉 Tu tarea: 1. Usa la palabra clave `let` para declarar una constante. 2. Asígnale un valor que use el operador lógico OR (`||`). Ejemplo: ```swift let isSunny = true || false ```
zh: 欢迎学习逻辑 OR 运算符的基础知识！🎉 您的任务： 1. 使用关键字 `let` 声明一个常量。 2. 为其赋值一个使用逻辑 OR (`||`) 的表达式。 示例： ```swift let isSunny = true || false ```

# exercise20SolutionContent
source: The correct solution is: ```swift let isSunny = true || false ```
es: La solución correcta es: ```swift let isSunny = true || false ```
zh: 正确答案是： ```swift let isSunny = true || false ```

# booleanNegationExplanation
source: Great! You''ve successfully used the boolean negation operator in Swift. Explanation: - The `!` operator negates a boolean value. For example, if `isSwiftFun` is `true`, `!isSwiftFun` becomes `false`.
es: ¡Genial! Has usado correctamente el operador de negación booleano en Swift. Explicación: - El operador `!` niega un valor booleano. Por ejemplo, si `isSwiftFun` es `true`, `!isSwiftFun` se convierte en `false`.
zh: 太棒了！你正确使用了 Swift 中的布尔取反运算符。 说明： - 运算符 `!` 用于取反布尔值。例如，如果 `isSwiftFun` 是 `true`，那么 `!isSwiftFun` 会变成 `false`。

# hint1BooleanNegation
source: Use the `var` keyword to declare two variables. Assign one a boolean value and negate it for the other.
es: Usa la palabra clave `var` para declarar dos variables. Asigna un valor booleano a una y su negación a la otra.
zh: 使用 `var` 关键字声明两个变量。为一个变量赋布尔值，为另一个变量赋第一个变量的取反值。

# hint2BooleanNegation
source: A correct example is: ```swift var isSwiftFun = true var notSwiftFun = !isSwiftFun ```
es: Un ejemplo correcto es: ```swift var isSwiftFun = true var notSwiftFun = !isSwiftFun ```
zh: 正确示例： ```swift var isSwiftFun = true var notSwiftFun = !isSwiftFun ```
