Repository: jojoji54/learnSwift
Catalog: lib/l10n/app_*.arb
Languages: es, zh

source: Close
es: Cerrar
zh: 关闭

# correctTitle
source: Correct! 🎉
es: ¡Correcto! 🎉
zh: 正确！🎉

# correctContent
source: Great! You''ve successfully declared a variable in Swift. Explanation: 1. You used the `var` keyword to create a variable. 2. The variable name can be any valid identifier, like `greeting`, `message`, or `g`. 3. The value assigned to the variable must be a valid string enclosed in double quotes (`"`).
es: ¡Genial! Has declarado una variable en Swift correctamente. Explicación: 1. Usaste la palabra clave `var` para crear una variable. 2. El nombre de la variable puede ser cualquier identificador válido, como `greeting`, `message` o `g`. 3. El valor asignado a la variable debe ser una cadena válida entre comillas dobles (`"`).
zh: 太棒了！您已经正确地在 Swift 中声明了一个变量。 说明： 1. 使用了关键字 `var` 创建变量。 2. 变量名可以是任意有效的标识符，例如 `greeting`、`message` 或 `g`。 3. 为变量赋值时，值必须是双引号括起来的有效字符串（`"`）。

# hint1Title
source: Hint 1
es: Pista 1
zh: 提示 1

# hint1Content
source: Use the `var` keyword to declare variables. For example: `var variableName = "value"`.
es: Usa la palabra clave `var` para declarar variables. Por ejemplo: `var nombreVariable = "valor"`.
zh: 使用关键字 `var` 声明变量。例如： `var nombreVariable = "valor"`。

# hint2Title
source: Hint 2
es: Pista 2
zh: 提示 2

# hint2Content
source: Make sure you''re using straight quotes (`"`) and not curly quotes (`“` or `”`).
es: Asegúrate de usar comillas rectas (`"`) y no comillas curvas (`“` o `”`).
zh: 确保使用的是直引号（`"`），而不是弯引号（`“` 或 `”`）。

# solutionTitle
source: Solution
es: Solución
zh: 解决方案

# solutionContent
source: The correct syntax is: `var variableName = "value"` Example: `var greeting = "Hello, World!"` `var g = "Swift"`
es: La sintaxis correcta es: `var nombreVariable = "valor"` Ejemplo: `var greeting = "Hello, World!"` `var g = "Swift"`
zh: 正确的语法是： `var nombreVariable = "valor"` 示例： `var greeting = "Hello, World!"` `var g = "Swift"`

# tryAgain
source: Try again! ({failedAttempts}/3 attempts)
es: ¡Intenta de nuevo! ({failedAttempts}/3 intentos)
zh: 再试一次！({failedAttempts}/3 次尝试)

# exerciseInstructionsTitle
source: Exercise Instructions
es: Instrucciones del ejercicio
zh: 练习说明

# exerciseInstructionsContent
source: Welcome to your first exercise in Swift! 🎉 Your task: Declare a variable named `greeting` and assign it the value "Hello, World!". Example: var greeting = "Hello, World!" Tip: Use the `var` keyword to declare a variable.
es: ¡Bienvenido a tu primer ejercicio en Swift! 🎉 Tu tarea: Declara una variable llamada `greeting` y asígnale el valor "Hello, World!". Ejemplo: var greeting = "Hello, World!" Consejo: Usa la palabra clave `var` para declarar una variable.
zh: 欢迎来到您的第一个 Swift 练习！🎉 您的任务：声明一个名为 `greeting` 的变量，并将其赋值为 "Hello, World!"。 示例： var greeting = "Hello, World!" 提示：使用关键字 `var` 声明变量。

source: Enter your code here
es: Ingresa tu código aquí
zh: 在此输入您的代码

# exercise2InstructionsContent
source: Welcome to the second exercise in Swift! 🎉 Your task: 1. Declare a variable named `number` and assign it the value 5. 2. Update the value of `number` by adding a number to it. Example: var number = 5 number = number + 10
es: ¡Bienvenido al segundo ejercicio en Swift! 🎉 Tu tarea: 1. Declara una variable llamada `number` y asígnale el valor 5. 2. Actualiza el valor de `number` sumándole un número. Ejemplo: var number = 5 number = number + 10
zh: 欢迎来到 Swift 的第二个练习！🎉 任务： 1. 声明一个名为 `number` 的变量，并将其赋值为 5。 2. 更新 `number` 的值并加上一个数字。 示例： var number = 5 number = number + 10

# exercise2CorrectContent
source: Great! You''ve successfully declared and updated a variable in Swift. Explanation: 1. You declared a variable named `number` and assigned it an initial value of 5. 2. Then, you updated its value by adding a number to it. This demonstrates how variables can be both declared and modified in Swift.
es: ¡Genial! Has declarado y actualizado correctamente una variable en Swift. Explicación: 1. Declaraste una variable llamada `number` y le asignaste el valor inicial de 5. 2. Luego, actualizaste su valor sumándole un número. Esto demuestra cómo las variables pueden declararse y modificarse en Swift.
zh: 太棒了！您已经正确地声明并更新了 Swift 中的变量。 说明： 1. 声明了一个名为 `number` 的变量，并赋予初始值 5。 2. 然后，通过加上一个数字更新了它的值。 这表明变量可以在 Swift 中声明和修改。

# exercise2Hint1Content
source: Use the `var` keyword to declare a variable. Assign an initial value like `var number = 5`.
es: Usa la palabra clave `var` para declarar una variable. Asigna un valor inicial como `var number = 5`.
zh: 使用关键字 `var` 声明变量。赋一个初始值，例如：`var number = 5`。

# exercise2Hint2Content
source: After declaring the variable, update its value by adding a number, e.g., `number = number + 10`.
es: Después de declarar la variable, actualiza su valor sumándole un número, por ejemplo: `number = number + 10`.
zh: 在声明变量后，通过加上一个数字来更新其值，例如：`number = number + 10`。

# exercise2SolutionContent
source: The correct solution is: var number = 5; number = number + 10;
es: La solución correcta es: var number = 5; number = number + 10;
zh: 正确答案是： var number = 5; number = number + 10;

# exercise3InstructionsContent
source: Welcome to your third exercise in Swift! 🎉 Your task: 1. Use the `print()` function to display a message in the console. 2. Try using any message you like inside the parentheses. Hint: Make sure your text is inside double quotes and follows the format `print("Your message")`.
es: ¡Bienvenido a tu tercer ejercicio en Swift! 🎉 Tu tarea: 1. Usa la función `print()` para mostrar un mensaje en la consola. 2. Prueba con cualquier mensaje que desees dentro de los paréntesis. Pista: Asegúrate de que tu texto esté entre comillas dobles y siga el formato `print("Tu mensaje")`.
zh: 欢迎来到 Swift 的第三个练习！🎉 任务： 1. 使用函数 `print()` 在控制台显示一条消息。 2. 在括号内输入您希望显示的任何消息。 提示：确保您的文本用双引号括起来，并遵循格式 `print("消息内容")`。

# exercise3CorrectContent
source: Well done! You''ve successfully used the `print()` function. Explanation: The `print()` function allows you to display any message in the console. For example: - print("Swift is fun!") - print("Hello, world!") Feel free to experiment with different messages.
es: ¡Bien hecho! Has usado correctamente la función `print()`. Explicación: La función `print()` te permite mostrar cualquier mensaje en la consola. Por ejemplo: - print("¡Swift es divertido!") - print("¡Hola, mundo!") Siéntete libre de experimentar con diferentes mensajes.
zh: 做得好！您正确地使用了 `print()` 函数。 说明： 函数 `print()` 可让您在控制台显示任何消息。例如： - print("Swift 很有趣！") - print("你好，世界！") 请随意尝试不同的消息。

# exercise3SolutionContent
source: The correct answer is any valid use of the `print()` function. For example: print("Swift is fun!") print("Learning is awesome!")
es: La respuesta correcta es cualquier uso válido de la función `print()`. Por ejemplo: print("¡Swift es divertido!") print("¡Aprender es genial!")
zh: 正确的答案是任何有效使用 `print()` 的代码。例如： print("Swift 很有趣！") print("学习很棒！")

# exercise4InstructionsContent
source: Welcome to this exercise in Swift! 🎉 Your task: Declare variables and perform an arithmetic operation. Example: var a = 5 var b = a var sum = a + b print(sum)
es: ¡Bienvenido a este ejercicio en Swift! 🎉 Tu tarea: Declara variables y realiza una operación aritmética. Ejemplo: var a = 5 var b = a var sum = a + b print(sum)
zh: 欢迎来到 Swift 的另一个练习！🎉 任务：声明变量并进行算术运算。 示例： var a = 5 var b = a var sum = a + b print(sum)

# exercise4CorrectContent
source: Great! You''ve successfully declared variables and performed arithmetic operations in Swift! Explanation: 1. You used the `var` keyword to declare variables. 2. You assigned values to the variables, including one variable depending on another. 3. You performed an arithmetic operation (`a + b`) and stored the result in a new variable `sum`. 4. Finally, you used `print(sum)` to display the result in the console. Understanding how to declare variables and use arithmetic operations is a fundamental step in programming.
es: ¡Genial! Has declarado variables y realizado operaciones aritméticas en Swift correctamente. Explicación: 1. Usaste la palabra clave `var` para declarar variables. 2. Asignaste valores a las variables, incluyendo una que depende de otra. 3. Realizaste una operación aritmética (`a + b`) y almacenaste el resultado en una nueva variable `sum`. 4. Finalmente, usaste `print(sum)` para mostrar el resultado en la consola. Entender cómo declarar variables y usar operaciones aritméticas es un paso fundamental en programación.
zh: 太棒了！您正确地声明了变量并完成了算术运算。 说明： 1. 使用了关键字 `var` 声明变量。 2. 为变量赋值，包括一个依赖于另一个变量的值。 3. 进行了算术运算（`a + b`），并将结果存储在新的变量 `sum` 中。 4. 最后，使用 `print(sum)` 在控制台显示了结果。 理解如何声明变量和使用算术运算是编程的基本步骤。

# exercise4Hint1Content
source: Remember to use the `var` keyword to declare variables and assign them values.
es: Recuerda usar la palabra clave `var` para declarar variables y asignarles valores.
zh: 记住使用关键字 `var` 声明变量并为其赋值。

# exercise4Hint2Content
source: Think about assigning a value to one variable using another, like `var b = a`.
es: Piensa en asignar un valor a una variable usando otra, como `var b = a`.
zh: 考虑使用另一个变量的值为变量赋值，例如 `var b = a`。

# exercise4Hint3Content
source: Structure your code like this: 1. Declare two variables. 2. Add them together. 3. Print the result.
es: Estructura tu código de esta manera: 1. Declara dos variables. 2. Súmalas. 3. Muestra el resultado.
zh: 按以下结构组织代码： 1. 声明两个变量。 2. 将它们相加。 3. 显示结果。

# hint3Title
source: Hint 3
es: Pista 3
zh: 提示 3

# exercise5InstructionsContent
source: Welcome to this exercise in Swift! 🎉 Your task: Declare a variable and use string interpolation. Example: var name = "John" print("Hello, my name is \(name)!")
es: ¡Bienvenido a este ejercicio en Swift! 🎉 Tu tarea: Declara una variable y usa la interpolación de cadenas. Ejemplo: var name = "Juan" print("Hola, mi nombre es \(name)!")
zh: 欢迎来到这个 Swift 练习！🎉 您的任务：声明一个变量并使用字符串插值。 示例： var name = "Juan" print("你好，我的名字是 \(name)！")

# exercise5CorrectContent
source: Well done! You''ve successfully used string interpolation in Swift! Explanation: 1. You declared a variable `name` and assigned it a value. 2. You used the `print()` function to display a message. 3. Inside `print()`, you included the variable `name` in the text using string interpolation (`\(name)`). String interpolation allows you to combine variables and text dynamically, making your code more powerful and expressive.
es: ¡Bien hecho! Has usado correctamente la interpolación de cadenas en Swift. Explicación: 1. Declaraste una variable `name` y le asignaste un valor. 2. Usaste la función `print()` para mostrar un mensaje. 3. Dentro de `print()`, incluiste la variable `name` en el texto utilizando la interpolación de cadenas (`\(name)`). La interpolación de cadenas te permite combinar variables y texto dinámicamente, haciendo que tu código sea más poderoso y expresivo.
zh: 做得好！您正确地使用了 Swift 的字符串插值。 说明： 1. 声明了一个变量 `name` 并赋值。 2. 使用了 `print()` 函数来显示消息。 3. 在 `print()` 中，利用字符串插值（`\(name)`）将变量 `name` 包含在文本中。 字符串插值使您可以动态地将变量和文本结合在一起，从而使代码更强大和富有表现力。

# exercise5Hint1Content
source: Remember to use the `var` keyword to declare a variable and assign it a value (e.g., var name = "John").
es: Recuerda usar la palabra clave `var` para declarar una variable y asignarle un valor (por ejemplo, var name = "Juan").
zh: 记住使用关键字 `var` 声明变量并赋值（例如，var name = "Juan"）。

# exercise5Hint2Content
source: Use string interpolation to combine a variable and text inside `print()`. For example: print("Hello, my name is \(name)!").
es: Usa la interpolación de cadenas para combinar una variable y texto dentro de `print()`. Por ejemplo: print("Hola, mi nombre es \(name)!").
zh: 使用字符串插值将变量和文本结合在 `print()` 中。例如：print("你好，我的名字是 \(name)！")。

# exercise5Hint3Content
source: Structure your code like this: 1. Declare a variable `name` and assign a value to it. 2. Use string interpolation to include `name` in a message using `print()`.
es: Estructura tu código así: 1. Declara una variable `name` y asígnale un valor. 2. Usa la interpolación de cadenas para incluir `name` en un mensaje usando `print()`.
zh: 按以下结构编写代码： 1. 声明一个变量 `name` 并赋值。 2. 使用字符串插值将 `name` 包含在消息中，使用 `print()`。

# exercise6InstructionsContent
source: Welcome to this exercise in Swift! 🎉 Your task: Calculate the area of a rectangle. 1. Declare variables `length` and `width`. 2. Multiply them to calculate the area. 3. Use `print()` to display the result. Example: var length = 5 var width = 10 var area = length * width print(area)
es: ¡Bienvenido a este ejercicio en Swift! 🎉 Tu tarea: Calcula el área de un rectángulo. 1. Declara las variables `length` y `width`. 2. Multiplícalas para calcular el área. 3. Usa `print()` para mostrar el resultado. Ejemplo: var length = 5 var width = 10 var area = length * width print(area)
zh: 欢迎来到这个 Swift 练习！🎉 您的任务：计算一个矩形的面积。 1. 声明变量 `length` 和 `width`。 2. 将它们相乘以计算面积。 3. 使用 `print()` 显示结果。 示例： var length = 5 var width = 10 var area = length * width print(area)

# exercise6CorrectContent
source: Great job! You''ve successfully calculated the area of a rectangle. Explanation: 1. `var length` and `var width` are used to declare dimensions of the rectangle. 2. Multiplying them gives the `area`. 3. `print(area)` displays the result.
es: ¡Buen trabajo! Has calculado correctamente el área de un rectángulo. Explicación: 1. `var length` y `var width` se usan para declarar las dimensiones del rectángulo. 2. Al multiplicarlas obtienes el `area`. 3. `print(area)` muestra el resultado.
zh: 做得好！您正确地计算了矩形的面积。 说明： 1. 使用 `var length` 和 `var width` 声明了矩形的尺寸。 2. 通过将它们相乘得到了 `area`。 3. 使用 `print(area)` 显示结果。

# exercise6Hint1Content
source: Remember to use the `var` keyword to declare variables.
es: Recuerda usar la palabra clave `var` para declarar variables.
zh: 记住使用关键字 `var` 声明变量。

# exercise6Hint2Content
source: Use `length * width` to calculate the area.
es: Usa `length * width` para calcular el área.
zh: 使用 `length * width` 来计算面积。

# exercise6Hint3Content
source: Here''s the correct structure: 1. Declare two variables for `length` and `width`. 2. Multiply them to calculate `area`. 3. Print the result.
es: Aquí está la estructura correcta: 1. Declara dos variables para `length` y `width`. 2. Multiplícalas para calcular el `area`. 3. Imprime el resultado.
zh: 以下是正确的结构： 1. 声明两个变量来表示 `length` 和 `width`。 2. 将它们相乘以计算 `area`。 3. 打印结果。

# exercise6SolutionContent
source: The correct answer is: var length = 5 var width = 10 var area = length * width print(area)
es: La respuesta correcta es: var length = 5 var width = 10 var area = length * width print(area)
zh: 正确答案是： var length = 5 var width = 10 var area = length * width print(area)

# exercise7InstructionsContent
source: Your task: Combine two strings using concatenation. Example: var firstName = "John" var lastName = "Doe" var fullName = firstName + " " + lastName print(fullName)
es: Tu tarea: Combina dos cadenas usando concatenación. Ejemplo: var firstName = "Juan" var lastName = "Pérez" var fullName = firstName + " " + lastName print(fullName)
zh: 您的任务：使用字符串连接组合两个字符串。 示例： var firstName = "Juan" var lastName = "Pérez" var fullName = firstName + " " + lastName print(fullName)

# exercise7CorrectContent
source: Well done! You''ve successfully concatenated strings in Swift. Explanation: 1. You declared two `String` variables. 2. You used the `+` operator to concatenate them. 3. Finally, you used `print()` to display the combined string.
es: ¡Bien hecho! Has concatenado correctamente cadenas en Swift. Explicación: 1. Declaraste dos variables de tipo `String`. 2. Usaste el operador `+` para concatenarlas. 3. Finalmente, usaste `print()` para mostrar la cadena combinada.
zh: 做得好！您正确地在 Swift 中连接了字符串。 说明： 1. 声明了两个 `String` 类型的变量。 2. 使用了 `+` 运算符将它们连接起来。 3. 最后，使用 `print()` 显示组合后的字符串。

# exercise7Hint1Content
source: Use the `+` operator to concatenate strings.
es: Usa el operador `+` para concatenar cadenas.
zh: 使用 `+` 运算符来连接字符串。

# exercise7Hint2Content
source: Combine the strings and include a space between them.
es: Combina las cadenas e incluye un espacio entre ellas.
zh: 连接字符串时包括一个空格。

# exercise7SolutionContent
source: The correct answer is: var firstName = "John" var lastName = "Doe" var fullName = firstName + " " + lastName print(fullName)
es: La respuesta correcta es: var firstName = "Juan" var lastName = "Pérez" var fullName = firstName + " " + lastName print(fullName)
zh: 正确答案是： var firstName = "Juan" var lastName = "Pérez" var fullName = firstName + " " + lastName print(fullName)

# exercise8InstructionsContent
source: Your task: Declare variables of different types (`Int`, `Double`, `String`, `Bool`) and print them. Example: var age: Int = 25 var height: Double = 1.75 var name: String = "Alice" var isStudent: Bool = true print(age) print(height) print(name) print(isStudent)
es: Tu tarea: Declara variables de diferentes tipos (`Int`, `Double`, `String`, `Bool`) e imprímelas. Ejemplo: var age: Int = 25 var height: Double = 1.75 var name: String = "Alice" var isStudent: Bool = true print(age) print(height) print(name) print(isStudent)
zh: 您的任务：声明不同类型的变量（`Int`、`Double`、`String`、`Bool`），并打印它们。 示例： var age: Int = 25 var height: Double = 1.75 var name: String = "Alice" var isStudent: Bool = true print(age) print(height) print(name) print(isStudent)

# exercise8CorrectContent
source: Great! You''ve successfully declared variables with different data types in Swift. Explanation: 1. `Int` is used for whole numbers. 2. `Double` is used for decimal numbers. 3. `String` is used for text. 4. `Bool` is used for true/false values. 5. `print()` displays the values of variables.
es: ¡Genial! Has declarado variables de diferentes tipos en Swift. Explicación: 1. `Int` se usa para números enteros. 2. `Double` se usa para números decimales. 3. `String` se usa para texto. 4. `Bool` se usa para valores true/false. 5. `print()` muestra los valores de las variables.
zh: 太棒了！您在 Swift 中正确地声明了不同类型的变量。 说明： 1. `Int` 用于整数。 2. `Double` 用于小数。 3. `String` 用于文本。 4. `Bool` 用于布尔值（真/假）。 5. `print()` 显示变量的值。

# exercise8Hint1Content
source: Make sure you specify the type of each variable. For example: `var age: Int = 25`.
es: Asegúrate de especificar el tipo de cada variable. Por ejemplo: `var age: Int = 25`.
zh: 确保为每个变量指定类型。例如：`var age: Int = 25`。

# exercise8Hint2Content
source: Remember to print all variables using `print(variableName)`.
es: Recuerda imprimir todas las variables usando `print(variableName)`.
zh: 记住使用 `print(variableName)` 打印所有变量。

# exercise8SolutionContent
source: The correct answer is: var age: Int = 25 var height: Double = 1.75 var name: String = "Alice" var isStudent: Bool = true print(age) print(height) print(name) print(isStudent)
es: La respuesta correcta es: var age: Int = 25 var height: Double = 1.75 var name: String = "Alice" var isStudent: Bool = true print(age) print(height) print(name) print(isStudent)
zh: 正确答案是： var age: Int = 25 var height: Double = 1.75 var name: String = "Alice" var isStudent: Bool = true print(age) print(height) print(name) print(isStudent)

# exercise10Hint2Content
source: Access elements in the array using their index. Remember, indexes start from 0.
es: Accede a los elementos en el array usando su índice. Recuerda, los índices comienzan desde 0.
zh: 通过索引访问数组中的元素。记住，索引从 0 开始。

# exercise10SolutionContent
source: The correct answer is: var numbers = [1, 2, 3] print(numbers[0]) print(numbers[2])
es: La respuesta correcta es: var numbers = [1, 2, 3] print(numbers[0]) print(numbers[2])
zh: 正确答案是： var numbers = [1, 2, 3] print(numbers[0]) print(numbers[2])

# exercise11InstructionsContent
source: Your task: Create and call a function that prints a message. Example: func greet() @ print("Hello, World!") & greet()
es: Tu tarea: Crea y llama a una función que imprima un mensaje. Ejemplo: func greet() @ print(\"¡Hola, Mundo!\") & greet()
zh: 您的任务：创建并调用一个函数来打印消息。 示例： func greet() @ print("你好，世界！") & greet()

# exercise11CorrectContent
source: Great! You''ve successfully created and called a function in Swift. Explanation: 1. You declared a function using the `func` keyword. 2. Inside the function, you used `print()` to display a message. 3. Finally, you called the function by its name followed by `()`.
es: ¡Genial! Has creado y llamado a una función en Swift. Explicación: 1. Declaraste una función usando la palabra clave `func`. 2. Dentro de la función, usaste `print()` para mostrar un mensaje. 3. Finalmente, llamaste a la función con su nombre seguido de `()`.
zh: 太棒了！您已经在 Swift 中创建并调用了一个函数。 说明： 1. 使用关键字 `func` 声明了一个函数。 2. 在函数内部，使用 `print()` 来显示消息。 3. 最后，使用函数名加上 `()` 来调用函数。

# exercise11Hint1Content
source: Start by declaring a function using the `func` keyword.
es: Empieza declarando una función usando la palabra clave `func`.
zh: 从使用关键字 `func` 声明一个函数开始。

# exercise11Hint2Content
source: Inside the function, use `print()` to display a message.
es: Dentro de la función, usa `print()` para mostrar un mensaje.
zh: 在函数内部，使用 `print()` 来显示一条消息。

# exercise11SolutionContent
source: The correct answer is: func greet() @ print("Hello, World!") & greet()
es: La respuesta correcta es: func greet() @ print(\"¡Hola, Mundo!\") & greet()
zh: 正确答案是： func greet() @ print("你好，世界！") & greet()

# exercise12InstructionsContent
source: Your task: Perform basic arithmetic operations. Example: var x = 10 var y = 5 var sum = x + y print(sum) var difference = x - y print(difference) var product = x * y print(product) var quotient = x / y print(quotient)
es: Tu tarea: Realiza operaciones aritméticas básicas. Ejemplo: var x = 10 var y = 5 var sum = x + y print(sum) var difference = x - y print(difference) var product = x * y print(product) var quotient = x / y print(quotient)
zh: 您的任务：执行基本的算术操作。 示例： var x = 10 var y = 5 var sum = x + y print(sum) var difference = x - y print(difference) var product = x * y print(product) var quotient = x / y print(quotient)

# exercise12CorrectContent
source: Great! You''ve successfully performed arithmetic operations in Swift. Explanation: 1. Declared variables for numbers. 2. Performed addition, subtraction, multiplication, and division. 3. Printed the results to the console.
es: ¡Genial! Has realizado operaciones aritméticas en Swift. Explicación: 1. Declaraste variables para los números. 2. Realizaste suma, resta, multiplicación y división. 3. Imprimiste los resultados en la consola.
zh: 太棒了！您在 Swift 中正确地完成了算术操作。 说明： 1. 为数字声明了变量。 2. 完成了加、减、乘和除运算。 3. 在控制台打印了结果。

# exercise12Hint1Content
source: Start by declaring two variables using the `var` keyword.
es: Empieza declarando dos variables usando la palabra clave `var`.
zh: 从使用关键字 `var` 声明两个变量开始。

# exercise12Hint2Content
source: Use `+`, `-`, `*`, and `/` for arithmetic operations.
es: Usa `+`, `-`, `*`, y `/` para las operaciones aritméticas.
zh: 使用 `+`、`-`、`*` 和 `/` 来执行算术操作。

# exercise12SolutionContent
source: The correct answer is: var x = 10 var y = 5 var sum = x + y print(sum) var difference = x - y print(difference) var product = x * y print(product) var quotient = x / y print(quotient)
es: La respuesta correcta es: var x = 10 var y = 5 var sum = x + y print(sum) var difference = x - y print(difference) var product = x * y print(product) var quotient = x / y print(quotient)
zh: 正确答案是： var x = 10 var y = 5 var sum = x + y print(sum) var difference = x - y print(difference) var product = x * y print(product) var quotient = x / y print(quotient)

# exercise13InstructionsContent
source: Your task: Declare constants and print their values. Example: let pi = 3.14159 let name = "John" let isActive = true print(pi) print(name) print(isActive)
es: Tu tarea: Declara constantes e imprime sus valores. Ejemplo: let pi = 3.14159 let name = "John" let isActive = true print(pi) print(name) print(isActive)
zh: 您的任务：声明常量并打印它们的值。 示例： let pi = 3.14159 let name = "John" let isActive = true print(pi) print(name) print(isActive)
