Repository: jojoji54/learnSwift
Catalog: lib/l10n/app_*.arb
Languages: es, zh

# exercise42Example
source: Example: ```swift var gpa = 3.8; var hasRecommendation = true; var isExtraCurricularActive = true; if gpa >= 3.5 && hasRecommendation == true && isExtraCurricularActive == true # print("Admitted"); º else # print("Not Admitted"); º ```
es: Ejemplo: ```swift var gpa = 3.8; var hasRecommendation = true; var isExtraCurricularActive = true; if gpa >= 3.5 && hasRecommendation == true && isExtraCurricularActive == true # print("Admitted"); º else # print("Not Admitted"); º ```
zh: 示例： ```swift var gpa = 3.8; var hasRecommendation = true; var isExtraCurricularActive = true; if gpa >= 3.5 && hasRecommendation == true && isExtraCurricularActive == true # print("Admitted"); º else # print("Not Admitted"); º ```

# exercise42Hint
source: Enter your code here
es: Escribe tu código aquí
zh: 在此输入你的代码

# exercise43IntroTitle
source: Exercise Instructions
es: Instrucciones del Ejercicio
zh: 练习说明

# exercise43IntroContent
source: Create a program that evaluates a student''s grade based on their `score`: 1. If `score` is >= 90, print `A`. 2. If `score` is >= 80, print `B`. 3. If `score` is >= 70, print `C`. 4. If `score` is >= 60, print `D`. 5. If `score` is below 60, print `F`.
es: Crea un programa que evalúe la calificación de un estudiante según su `score`: 1. Si `score` es >= 90, imprime `A`. 2. Si `score` es >= 80, imprime `B`. 3. Si `score` es >= 70, imprime `C`. 4. Si `score` es >= 60, imprime `D`. 5. Si `score` es menor a 60, imprime `F`.
zh: 创建一个程序，根据学生的 `score` 评估成绩： 1. 如果 `score` >= 90，打印 `A`。 2. 如果 `score` >= 80，打印 `B`。 3. 如果 `score` >= 70，打印 `C`。 4. 如果 `score` >= 60，打印 `D`。 5. 如果 `score` 小于 60，打印 `F`。

# exercise43CorrectTitle
source: Correct! 🎉
es: ¡Correcto! 🎉
zh: 正确！🎉

# exercise43CorrectContent
source: Great! You''ve successfully implemented a grade evaluation system. **Explanation:** - Each `if` or `else if` checks if the `score` falls within a range. - Based on the score, the corresponding grade is printed. This structure is efficient for evaluating multiple conditions in decision-making scenarios.
es: ¡Muy bien! Has implementado con éxito un sistema de evaluación de calificaciones. **Explicación:** - Cada `if` o `else if` verifica si el `score` está dentro de un rango. - Según el puntaje, se imprime la calificación correspondiente. Esta estructura es eficiente para evaluar múltiples condiciones en escenarios de toma de decisiones.
zh: 干得好！你成功实现了一个评分评估系统。 **说明：** - 每个 `if` 或 `else if` 检查 `score` 是否在指定范围内。 - 根据得分打印相应的成绩。 这种结构在多条件决策场景中非常高效。

# exercise43Hint1Title
source: Hint 1
es: Pista 1
zh: 提示 1

# exercise43Hint1Content
source: Start by declaring a `score` variable. Example: `var score = 85`.
es: Comienza declarando una variable `score`. Ejemplo: `var score = 85`.
zh: 首先声明一个变量 `score`。示例：`var score = 85`。

# exercise43Hint2Title
source: Hint 2
es: Pista 2
zh: 提示 2

# exercise43Hint2Content
source: Use `if-else if-else` statements to compare `score` values and print grades.
es: Usa declaraciones `if-else if-else` para comparar los valores de `score` y imprimir calificaciones.
zh: 使用 `if-else if-else` 语句比较 `score` 的值并打印成绩。

# exercise43SolutionTitle
source: Solution
es: Solución
zh: 解决方案

# exercise43SolutionContent
source: The correct solution is: ```swift var score = 85; if score >= 90 # print("A"); º else if score >= 80 # print("B"); º else if score >= 70 # print("C"); º else if score >= 60 # print("D"); º else # print("F"); º ```
es: La solución correcta es: ```swift var score = 85; if score >= 90 # print("A"); º else if score >= 80 # print("B"); º else if score >= 70 # print("C"); º else if score >= 60 # print("D"); º else # print("F"); º ```
zh: 正确的解决方案是： ```swift var score = 85; if score >= 90 # print("A"); º else if score >= 80 # print("B"); º else if score >= 70 # print("C"); º else if score >= 60 # print("D"); º else # print("F"); º ```

# exercise43Example
source: Example: ```swift var score = 85; if score >= 90 # print("A"); º else if score >= 80 # print("B"); º else if score >= 70 # print("C"); º else if score >= 60 # print("D"); º else # print("F"); º ```
es: Ejemplo: ```swift var score = 85; if score >= 90 # print("A"); º else if score >= 80 # print("B"); º else if score >= 70 # print("C"); º else if score >= 60 # print("D"); º else # print("F"); º ```
zh: 示例： ```swift var score = 85; if score >= 90 # print("A"); º else if score >= 80 # print("B"); º else if score >= 70 # print("C"); º else if score >= 60 # print("D"); º else # print("F"); º ```

# exercise43Hint
source: Enter your code here
es: Escribe tu código aquí
zh: 在此输入代码

# exercise44IntroTitle
source: Exercise Instructions
es: Instrucciones del Ejercicio
zh: 练习说明

# exercise44IntroContent
source: Create a program to check the strength of a password based on these conditions: 1. **Strong**: At least 8 characters, contains both letters and numbers. 2. **Weak**: At least 6 characters but doesn''t meet all criteria for "Strong". 3. **Very Weak**: Fewer than 6 characters.
es: Crea un programa para comprobar la fortaleza de una contraseña basado en estas condiciones: 1. **Fuerte**: Al menos 8 caracteres, contiene letras y números. 2. **Débil**: Al menos 6 caracteres, pero no cumple con los criterios de "Fuerte". 3. **Muy Débil**: Menos de 6 caracteres.
zh: 创建一个程序，根据以下条件检查密码强度： 1. **强密码**：至少 8 个字符，包含字母和数字。 2. **弱密码**：至少 6 个字符，但未达到 "强密码" 标准。 3. **非常弱密码**：少于 6 个字符。

# exercise44CorrectTitle
source: Correct! 🎉
es: ¡Correcto! 🎉
zh: 正确！🎉

# exercise44CorrectContent
source: Great! You''ve successfully implemented a password strength checker. Explanation: - **Strong Password:** At least 8 characters, contains both letters and numbers. - **Weak Password:** At least 6 characters but missing strong criteria. - **Very Weak Password:** Less than 6 characters.
es: ¡Muy bien! Has implementado un verificador de fortaleza de contraseñas. Explicación: - **Contraseña Fuerte:** Al menos 8 caracteres, contiene letras y números. - **Contraseña Débil:** Al menos 6 caracteres, pero faltan criterios fuertes. - **Contraseña Muy Débil:** Menos de 6 caracteres.
zh: 干得好！你已经实现了一个密码强度检查器。 **说明：** - **强密码**：至少 8 个字符，包含字母和数字。 - **弱密码**：至少 6 个字符，但缺少强密码的必要条件。 - **非常弱密码**：少于 6 个字符。

# exercise44Hint1Title
source: Hint 1
es: Pista 1
zh: 提示 1

# exercise44Hint1Content
source: Declare a `password` variable. Example: `var password = "abc123"`.
es: Declara una variable `password`. Ejemplo: `var password = "abc123"`.
zh: 声明一个变量 `password`。示例：`var password = "abc123"`。

# exercise44Hint2Title
source: Hint 2
es: Pista 2
zh: 提示 2

# exercise44Hint2Content
source: Use `.count` to check the length and `.contains` to validate the password''s contents.
es: Usa `.count` para comprobar la longitud y `.contains` para validar el contenido.
zh: 使用 `.count` 检查长度，使用 `.contains` 验证内容。

# exercise44SolutionTitle
source: Solution
es: Solución
zh: 解决方案

# exercise44SolutionContent
source: The correct solution is: ```swift var password = "abc123"; if password.count >= 8 && password.contains("\d") && password.contains("\w") # print("Strong"); º else if password.count >= 6 # print("Weak"); º else # print("Very Weak"); º ```
es: La solución correcta es: ```swift var password = "abc123"; if password.count >= 8 && password.contains("\d") && password.contains("\w") # print("Fuerte"); º else if password.count >= 6 # print("Débil"); º else # print("Muy Débil"); º ```
zh: 正确的解决方案是： ```swift var password = "abc123"; if password.count >= 8 && password.contains("\d") && password.contains("\w") # print("强密码"); º else if password.count >= 6 # print("弱密码"); º else # print("非常弱密码"); º ```

# exercise44Example
source: Example: ```swift var password = "abc123"; if password.count >= 8 && password.contains("\d") && password.contains("\w") # print("Strong"); º else if password.count >= 6 # print("Weak"); º else # print("Very Weak"); º ```
es: Ejemplo: ```swift var password = "abc123"; if password.count >= 8 && password.contains("\d") && password.contains("\w") # print("Fuerte"); º else if password.count >= 6 # print("Débil"); º else # print("Muy Débil"); º ```
zh: 示例： ```swift var password = "abc123"; if password.count >= 8 && password.contains("\d") && password.contains("\w") # print("强密码"); º else if password.count >= 6 # print("弱密码"); º else # print("非常弱密码"); º ```

# exercise44Hint
source: Enter your password here
es: Escribe tu contraseña aquí
zh: 在此输入密码

# exercise45IntroTitle
source: Exercise Instructions
es: Instrucciones del Ejercicio
zh: 练习说明

# exercise45IntroContent
source: Create a program that assigns grades based on a score: 1. If `score >= 90`, grade is `A`. 2. If `score >= 80`, grade is `B`. 3. If `score >= 70`, grade is `C`. 4. If `score >= 60`, grade is `D`. 5. If `score < 60`, grade is `F`.
es: Crea un programa que asigne calificaciones según una puntuación: 1. Si `score >= 90`, calificación `A`. 2. Si `score >= 80`, calificación `B`. 3. Si `score >= 70`, calificación `C`. 4. Si `score >= 60`, calificación `D`. 5. Si `score < 60`, calificación `F`.
zh: 创建一个程序，根据分数分配成绩： 1. 如果 `score >= 90`，成绩为 `A`。 2. 如果 `score >= 80`，成绩为 `B`。 3. 如果 `score >= 70`，成绩为 `C`。 4. 如果 `score >= 60`，成绩为 `D`。 5. 如果 `score < 60`，成绩为 `F`。

# exercise45CorrectTitle
source: Correct! 🎉
es: ¡Correcto! 🎉
zh: 正确！🎉

# exercise45CorrectContent
source: Well done! You''ve successfully implemented an `if-else` grading system.
es: ¡Bien hecho! Has implementado correctamente un sistema de calificaciones con `if-else`.
zh: 干得好！你已经正确地用 `if-else` 实现了评分系统。

# exercise45Hint1Title
source: Hint 1
es: Pista 1
zh: 提示 1

# exercise45Hint1Content
source: Declare a variable `score`. Example: `var score = 85`.
es: Declara una variable `score`. Ejemplo: `var score = 85`.
zh: 声明一个变量 `score`。示例：`var score = 85`。

# exercise45Hint2Title
source: Hint 2
es: Pista 2
zh: 提示 2

# exercise45Hint2Content
source: Use `if` to check if `score >= 90`, and add `else-if` for other ranges.
es: Usa `if` para comprobar si `score >= 90`, y añade `else-if` para otros rangos.
zh: 使用 `if` 检查 `score >= 90`，并为其他范围添加 `else-if`。

# exercise45Hint3Title
source: Hint 3
es: Pista 3
zh: 提示 3

# exercise45Hint3Content
source: Complete the structure for all grade ranges.
es: Completa la estructura para todos los rangos de calificación.
zh: 为所有评分范围完成结构。

# exercise45SolutionTitle
source: Solution
es: Solución
zh: 解决方案

# exercise45SolutionContent
source: The correct solution is: ```swift var score = 85; if (score >= 90) # print("The grade is A"); º else if (score >= 80) # print("The grade is B"); º else if (score >= 70) # print("The grade is C"); º else if (score >= 60) # print("The grade is D"); º else # print("The grade is F"); º ```
es: La solución correcta es: ```swift var score = 85; if (score >= 90) # print("The grade is A"); º else if (score >= 80) # print("The grade is B"); º else if (score >= 70) # print("The grade is C"); º else if (score >= 60) # print("The grade is D"); º else # print("The grade is F"); º ```
zh: 正确的解决方案是： ```swift var score = 85; if (score >= 90) # print("成绩为 A"); º else if (score >= 80) # print("成绩为 B"); º else if (score >= 70) # print("成绩为 C"); º else if (score >= 60) # print("成绩为 D"); º else # print("成绩为 F"); º ```

# exercise45Example
source: Example: ```swift var score = 85; if (score >= 90) # print("The grade is A"); º else # ... º ```
es: Ejemplo: ```swift var score = 85; if (score >= 90) # print("The grade is A"); º else # ... º ```
zh: 示例： ```swift var score = 85; if (score >= 90) # print("成绩为 A"); º else # ... º ```

# exercise45Hint
source: Enter your code here
es: Escribe tu código aquí
zh: 在此输入代码

# purchaseSuccess
source: Purchase completed successfully!
es: ¡Compra completada con éxito!
zh: 购买成功！

# purchaseError
source: There was an error during the purchase. Please try again.
es: Hubo un error durante la compra. Inténtalo de nuevo.
zh: 购买过程中出现错误，请重试。

# purchasePending
source: Purchase pending. Please wait...
es: Compra pendiente. Por favor, espera...
zh: 购买待处理，请稍候...

# purchaseException
source: An unexpected issue occurred. Please try again later.
es: Se produjo un problema inesperado. Inténtalo más tarde.
zh: 发生意外问题，请稍后再试。

# aboutLearnSwiftTitle
source: About CodeCrafters
es: Acerca de LearnSwift
zh: 关于 CodeCrafters

# aboutLearnSwiftContent
source: CodeCrafters: Swift is an application designed to help users learn Swift, the powerful programming language used to create apps for Apple platforms. This app includes interactive exercises to build a solid foundation in Swift programming. Version: Swift 5.9 If you have any questions or feedback, feel free to reach out through any of the following platforms:
es: LearnSwift es una aplicación diseñada para ayudar a los usuarios a aprender Swift, el poderoso lenguaje de programación utilizado para crear aplicaciones en las plataformas de Apple. Esta aplicación incluye ejercicios interactivos para construir una base sólida en la programación de Swift. Versión: Swift 5.9 Si tienes alguna pregunta o comentario, no dudes en ponerte en contacto a través de cualquiera de las siguientes plataformas:
zh: CodeCrafters:Swift 是一款旨在帮助用户学习 Swift 的应用，Swift 是用于在 Apple 平台上创建应用的强大编程语言。此应用包含交互式练习，可帮助您在 Swift 编程中打下坚实基础。 版本：Swift 5.9 如果您有任何疑问或意见，请通过以下任一平台与我们联系：

# comingSoonButton
source: Coming Soon
zh: 即将推出

# comingSoonTitle
source: Upcoming Courses
zh: 即将推出的课程

# pythonCorrectTitle
source: Correct! 🎉
zh: 正确！🎉

# pythonCorrectExplanation
source: Great! You successfully used the `print()` function in Python. **Explanation:** - The `print()` function outputs the content passed to it inside the parentheses to the console. - You can pass text, variables, or even expressions to `print()`.
zh: 很好！你成功使用了Python的`print()`函数。 **解释：** - `print()`函数会将括号中的内容输出到控制台。 - 你可以传递文本、变量或表达式给`print()`。

# pythonHintTitle1
source: Hint 1
zh: 提示 1

# pythonHintContent1
source: Use the `print()` function to display a message. For example: ```python print("Hello, Python!") ```
zh: 使用`print()`函数显示消息。例如： ```python print("你好，Python！") ```

# pythonHintTitle2
source: Hint 2
zh: 提示 2

# pythonHintContent2
source: Ensure that your `print()` statement is correctly formatted. Example: ```python print("This is a test message") ```
zh: 确保你的`print()`语句格式正确。例如： ```python print("这是一个测试消息") ```

# pythonSolutionTitle
source: Solution
zh: 解决方案

# pythonSolutionContent
source: The correct solution is: ```python print("Hello, Python!") ```
zh: 正确的解决方案是： ```python print("你好，Python！") ```

# pythonInstructionsTitle
source: Exercise Instructions
zh: 练习说明

# pythonInstructionsContent
source: Welcome to Python Basics: Print Anything! 🎉 Your task: 1. Use the `print()` function to display a message in the console. 2. You can print anything, such as text, a variable, or an expression.
zh: 欢迎来到Python基础：打印任何内容！🎉 你的任务： 1. 使用`print()`函数在控制台显示消息。 2. 你可以打印任何内容，比如文本、变量或表达式。

# pythonExampleTitle
source: Example:
zh: 示例：

# pythonExampleOutput
source: Hello, Python!
zh: 你好，Python！

# pythonEnterCodeHint
source: Enter your Python code here
zh: 在这里输入你的Python代码

# pythonHintTitle3
source: Hint 1
zh: 提示 1

# pythonHintContent3
source: Declare a variable named `name` and assign it a value. For example: ```python name = "Alice" ```
zh: 声明一个名为`name`的变量，并为其赋值。例如： ```python name = "Alice" ```

# pythonHintTitle4
source: Hint 2
zh: 提示 2

# pythonHintContent4
source: Use `+` to concatenate strings. Example: ```python print("Hello, " + name) ```
zh: 使用`+`来连接字符串。示例： ```python print("你好, " + name) ```

# pythonSolutionContent2
source: The correct solution is: ```python name = "Alice" print("Hello, " + name) ```
zh: 正确的解决方案是： ```python name = "Alice" print("你好, " + name) ```

# pythonInstructionsTitle2
source: Exercise Instructions
zh: 练习说明

# pythonInstructionsContent2
source: Welcome to Python Basics: Personalized Greeting! 🎉 Your task: 1. Declare a variable named `name` and assign it your name. 2. Use `+` to concatenate a greeting message with the variable. 3. Print the full message using the `print()` function.
zh: 欢迎来到Python基础：个性化问候！🎉 你的任务： 1. 声明一个名为`name`的变量，并将你的名字赋值给它。 2. 使用`+`将问候消息与变量连接起来。 3. 使用`print()`函数打印完整消息。

# pythonExampleTitle2
source: Example:
zh: 示例：

# pythonExampleOutput2
source: Hello, Alice!
zh: 你好, Alice!

# pythonHintTitle5
source: Hint 1
zh: 提示 1

# pythonHintContent5
source: Declare two variables and assign them values. For example: ```python a = 10 b = 20 ```
zh: 声明两个变量并为它们赋值。例如： ```python a = 10 b = 20 ```

# pythonHintTitle6
source: Hint 2
zh: 提示 2

# pythonHintContent6
source: Perform a mathematical operation between the variables. Example: ```python print(a + b) ```
zh: 对变量执行数学运算。例如： ```python print(a + b) ```

# pythonSolutionContent3
source: The correct solution is: ```python a = 10 b = 20 print(a + b) ```
zh: 正确的解决方案是： ```python a = 10 b = 20 print(a + b) ```

# pythonInstructionsTitle3
source: Exercise Instructions
zh: 练习说明

# pythonInstructionsContent3
source: Welcome to Python Basics: Mathematical Operations! 🎉 Your task: 1. Declare two variables and assign integer values to them. 2. Use an operator like `+`, `-`, `*`, or `/` to perform an operation between them. 3. Print the result using the `print()` function.
zh: 欢迎学习 Python 基础：数学运算！ 🎉 你的任务： 1. 声明两个变量并为它们赋整数值。 2. 使用 `+`、`-`、`*` 或 `/` 运算符在它们之间进行操作。 3. 使用 `print()` 函数打印结果。

# pythonExampleTitle3
source: Example:
zh: 示例：

# pythonEnterCodeHint3
source: Write your code to perform the operation
zh: 编写代码以执行操作

# pythonCorrectTitle2
source: Correct! 🎉
zh: 正确！🎉

# pythonCorrectExplanation2
source: Well done! You successfully performed a mathematical operation. **Explanation:** - Declare variables using `=` and assign values. - Use operators like `+`, `-`, `*`, or `/` to perform calculations. - Print the result using the `print()` function.
zh: 做得好！你成功完成了数学运算。 **解释：** - 使用 `=` 声明变量并赋值。 - 使用 `+`、`-`、`*` 或 `/` 运算符进行计算。 - 使用 `print()` 函数打印结果。

# pythonCorrectTitle3
source: Correct! 🎉
zh: 正确！🎉

# pythonCorrectExplanation3
source: Great job! You successfully manipulated a string in Python. **Explanation:** - Strings in Python are objects and have methods like `.upper()`, `.lower()`, and `.capitalize()` that you can use to modify them. - Use `+` to concatenate strings and create new phrases.
zh: 太棒了！你成功操作了一个 Python 字符串。 **解释：** - Python 中的字符串是对象，可以使用 `.upper()`、`.lower()` 和 `.capitalize()` 等方法来修改它们。 - 使用 `+` 来连接字符串并创建新短语。

# pythonHintTitle7
source: Hint 1
zh: 提示 1

# pythonHintContent7
source: Declare a string variable and assign it a value. For example: ```python text = "Hello, Python" ```
zh: 声明一个字符串变量并为其赋值。例如： ```python text = "你好，Python" ```

# pythonHintTitle8
source: Hint 2
zh: 提示 2

# pythonHintContent8
source: Use a method like `.upper()` or `.lower()` to manipulate the string. Example: ```python print(text.upper()) ```
zh: 使用 `.upper()` 或 `.lower()` 等方法操作字符串。例如： ```python print(text.upper()) ```

# pythonSolutionContent4
source: The correct solution is: ```python text = "Hello, Python" print(text.upper()) ```
zh: 正确的解决方案是： ```python text = "你好，Python" print(text.upper()) ```

# pythonInstructionsTitle4
source: Exercise Instructions
zh: 练习说明

# pythonInstructionsContent4
source: Welcome to Python Basics: String Manipulation! 🎉 Your task: 1. Declare a string variable with a message. 2. Use a method like `.upper()`, `.lower()`, or `.capitalize()` to modify the string. 3. Print the result using the `print()` function.
zh: 欢迎学习 Python 基础：字符串操作！ 🎉 你的任务： 1. 声明一个包含消息的字符串变量。 2. 使用 `.upper()`、`.lower()` 或 `.capitalize()` 等方法修改字符串。 3. 使用 `print()` 函数打印结果。

# pythonExampleTitle4
source: Example:
zh: 示例：

# pythonExampleOutput4
source: HELLO, PYTHON
zh: 你好，PYTHON

# pythonEnterCodeHint4
source: Write your code to manipulate the string
zh: 编写代码以操作字符串

# exercise9InstructionsContent
source: Your task: Declare constants using `let` and print their values. Example: let pi = 3.14159 let appName = "Swift Learning" print(pi) print(appName)
es: Tu tarea: Declara constantes usando `let` e imprime sus valores. Ejemplo: let pi = 3.14159 let appName = "Swift Learning" print(pi) print(appName)

# exercise9CorrectContent
source: Well done! You successfully declared constants in Swift and used them in your code. Explanation: 1. `let` is used to declare constants. 2. Constants cannot be changed once assigned a value. 3. You printed the constants correctly to verify their values.
es: ¡Bien hecho! Has declarado constantes en Swift y las usaste en tu código. Explicación: 1. `let` se usa para declarar constantes. 2. Las constantes no se pueden cambiar una vez asignadas. 3. Imprimiste las constantes correctamente para verificar sus valores.

# exercise9Hint1Content
source: Remember to use the `let` keyword to declare constants.
es: Recuerda usar la palabra clave `let` para declarar constantes.

# exercise9Hint2Content
source: Ensure that your constants are being printed correctly, like `print(constantName)`.
es: Asegúrate de imprimir las constantes correctamente, como `print(constantName)`.

# exercise9SolutionContent
source: The correct answer is: let pi = 3.14159 let appName = "Swift Learning" print(pi) print(appName)
es: La respuesta correcta es: let pi = 3.14159 let appName = "Swift Learning" print(pi) print(appName)

# exercise10InstructionsContent
source: Your task: Create an array with three integers and print specific elements. Example: var fruits = ["Apple", "Banana", "Cherry"] print(fruits[0]) print(fruits[2])
es: Tu tarea: Crea un array con tres enteros e imprime elementos específicos. Ejemplo: var fruits = ["Manzana", "Banana", "Cereza"] print(fruits[0]) print(fruits[2])

# exercise10CorrectContent
source: Great! You have successfully created an array and accessed its elements. Explanation: 1. Arrays are collections of ordered values. 2. You used square brackets `[]` to create the array. 3. To access elements, you used their index inside square brackets, starting from `0`.
es: ¡Genial! Has creado correctamente un array y accedido a sus elementos. Explicación: 1. Los arrays son colecciones de valores ordenados. 2. Usaste corchetes `[]` para crear el array. 3. Para acceder a los elementos, usaste su índice dentro de los corchetes, comenzando desde `0`.

# exercise10Hint1Content
source: Start by creating an array using square brackets `[]`.
es: Comienza creando un array usando corchetes `[]`.
