Repository: jojoji54/learnSwift
Catalog: lib/l10n/app_*.arb
Languages: es, zh

# exercise36Hint2Content
source: Use `if-else` to check if the value matches a condition: - If `fruit == "apple"`, print "It''s an apple!".
es: Usa `if-else` para comprobar si el valor coincide con una condición: - Si `fruit == "apple"`, imprime "¡Es una manzana!".
zh: 使用 `if-else` 检查值是否满足条件： - 如果 `fruit == "apple"`，打印 "这是一个苹果！"。

# exercise36SolutionTitle
source: Solution
es: Solución
zh: 解决方案

# exercise36SolutionContent
source: The correct solution is: ```swift var fruit = "apple"; if (fruit == "apple") # print("It''s an apple!"); º else # print("It''s not an apple!"); º```
es: La solución correcta es: ```swift var fruit = "apple"; if (fruit == "apple") # print("¡Es una manzana!"); º else # print("¡No es una manzana!"); º```
zh: 正确的解决方案是： ```swift var fruit = "apple"; if (fruit == "apple") # print("这是一个苹果！"); º else # print("这不是一个苹果！"); º```

# exercise36Example
source: Example: ```swift var fruit = "apple"; if (fruit == "apple") # print("It''s an apple!"); º else # print("It''s not an apple!"); º```
es: Ejemplo: ```swift var fruit = "apple"; if (fruit == "apple") # print("¡Es una manzana!"); º else # print("¡No es una manzana!"); º```
zh: 示例： ```swift var fruit = "apple"; if (fruit == "apple") # print("这是一个苹果！"); º else # print("这不是一个苹果！"); º```

# exercise36Hint
source: Enter your code here
es: Ingresa tu código aquí
zh: 在此输入你的代码

# exercise37IntroTitle
source: Exercise Instructions
es: Instrucciones del Ejercicio
zh: 练习说明

# exercise37IntroContent
source: Welcome to Numerical Comparisons! 🎉 Your task: 1. Declare a variable named `temperature` and assign it a numerical value. 2. Use `if` to check if the value is greater, less than, or equal to a specific number. 3. Use `else` to handle other cases. Example: ```swift var temperature = 25; if (temperature > 20) # print("It''s warm!"); º else # print("It''s cold!"); º```
es: ¡Bienvenido a Comparaciones Numéricas! 🎉 Tu tarea: 1. Declara una variable llamada `temperature` y asígnale un valor numérico. 2. Usa `if` para verificar si el valor es mayor, menor o igual a un número específico. 3. Usa `else` para manejar otros casos. Ejemplo: ```swift var temperature = 25; if (temperature > 20) # print("¡Hace calor!"); º else # print("¡Hace frío!"); º```
zh: 欢迎来到数值比较！🎉 你的任务： 1. 声明一个名为 `temperature` 的变量并赋值为一个数字。 2. 使用 `if` 检查该值是否大于、小于或等于特定数字。 3. 使用 `else` 处理其他情况。 示例： ```swift var temperature = 25; if (temperature > 20) # print("天气很热！"); º else # print("天气很冷！"); º```

# exercise37CorrectTitle
source: Correct! 🎉
es: ¡Correcto! 🎉
zh: 正确！🎉

# exercise37CorrectContent
source: Great! You''ve successfully used `if-else` to compare numerical values. Explanation: - Use comparison operators like `>`, `<`, `>=`, and `<=` to evaluate numbers. - The code inside `if` executes if the condition is true; otherwise, the `else` block runs.
es: ¡Genial! Has usado correctamente `if-else` para comparar valores numéricos. Explicación: - Usa operadores como `>`, `<`, `>=` y `<=` para evaluar números. - El código dentro de `if` se ejecuta si la condición es verdadera; de lo contrario, se ejecuta el bloque `else`.
zh: 太棒了！你已经正确使用了 `if-else` 比较数值。 说明： - 使用 `>`、`<`、`>=` 和 `<=` 等运算符来评估数字。 - 如果条件为真，`if` 中的代码将执行；否则，`else` 中的代码将执行。

# exercise37Hint1Title
source: Hint 1
es: Pista 1
zh: 提示 1

# exercise37Hint1Content
source: Start by declaring a variable `temperature` and assigning it a number, e.g., `var temperature = 25`.
es: Comienza declarando una variable `temperature` y asignándole un número, por ejemplo, `var temperature = 25`.
zh: 先声明一个变量 `temperature` 并赋值为一个数字，例如：`var temperature = 25`。

# exercise37Hint2Title
source: Hint 2
es: Pista 2
zh: 提示 2

# exercise37Hint2Content
source: Use `if` to compare `temperature` to another number, e.g., `if (temperature > 20) # ... º`.
es: Usa `if` para comparar `temperature` con otro número, por ejemplo, `if (temperature > 20) # ... º`.
zh: 使用 `if` 比较 `temperature` 和另一个数字，例如：`if (temperature > 20) # ... º`。

# exercise37SolutionTitle
source: Solution
es: Solución
zh: 解决方案

# exercise37SolutionContent
source: The correct solution is: ```swift var temperature = 25; if (temperature > 20) # print("It''s warm!"); º else # print("It''s cold!"); º```
es: La solución correcta es: ```swift var temperature = 25; if (temperature > 20) # print("¡Hace calor!"); º else # print("¡Hace frío!"); º```
zh: 正确的解决方案是： ```swift var temperature = 25; if (temperature > 20) # print("天气很热！"); º else # print("天气很冷！"); º```

# exercise37Example
source: Example: ```swift var temperature = 25; if (temperature > 20) # print("It''s warm!"); º else # print("It''s cold!"); º```
es: Ejemplo: ```swift var temperature = 25; if (temperature > 20) # print("¡Hace calor!"); º else # print("¡Hace frío!"); º```
zh: 示例： ```swift var temperature = 25; if (temperature > 20) # print("天气很热！"); º else # print("天气很冷！"); º```

# exercise37Hint
source: Enter your code here
es: Ingresa tu código aquí
zh: 在此输入你的代码

# exercise38IntroTitle
source: Exercise Instructions
es: Instrucciones del Ejercicio
zh: 练习说明

# exercise38IntroContent
source: Welcome to Nested If-Else Statements! 🎉 Your task: 1. Declare a variable named `number` and assign it an integer value. 2. Use an `if-else` structure to categorize the number as positive, negative, or zero. Example: ```swift var number = 5; if (number > 0) # print("Positive"); º else if (number < 0) # print("Negative"); º else # print("Zero"); º```
es: ¡Bienvenido a Sentencias If-Else Anidadas! 🎉 Tu tarea: 1. Declara una variable llamada `number` y asígnale un valor entero. 2. Usa una estructura `if-else` para clasificar el número como positivo, negativo o cero. Ejemplo: ```swift var number = 5; if (number > 0) # print("Positivo"); º else if (number < 0) # print("Negativo"); º else # print("Cero"); º```
zh: 欢迎来到嵌套的 If-Else 语句！🎉 你的任务： 1. 声明一个名为 `number` 的变量并赋值为一个整数。 2. 使用 `if-else` 结构将数字分类为正数、负数或零。 示例： ```swift var number = 5; if (number > 0) # print("正数"); º else if (number < 0) # print("负数"); º else # print("零"); º```

# exercise38CorrectTitle
source: Correct! 🎉
es: ¡Correcto! 🎉
zh: 正确！🎉

# exercise38CorrectContent
source: Great! You''ve successfully implemented a nested `if-else` structure to handle multiple conditions. Explanation: - If the number is greater than 0, it's a positive number. - If the number is less than 0, it's a negative number. - Otherwise, the number is zero. This is a simple way to categorize numbers based on their values.
es: ¡Genial! Has implementado correctamente una estructura `if-else` anidada para manejar múltiples condiciones. Explicación: - Si el número es mayor que 0, es un número positivo. - Si el número es menor que 0, es un número negativo. - De lo contrario, el número es cero. Esta es una forma sencilla de categorizar números según sus valores.
zh: 太棒了！你已经正确实现了嵌套的 `if-else` 结构来处理多个条件。 说明： - 如果数字大于 0，它是一个正数。 - 如果数字小于 0，它是一个负数。 - 否则，数字为零。 这是根据数字的值对其进行分类的简单方法。

# exercise38Hint1Title
source: Hint 1
es: Pista 1
zh: 提示 1

# exercise38Hint1Content
source: Start by declaring a variable `number` and assigning it a value. Use `if (number > 0)` to check if the number is positive.
es: Comienza declarando una variable `number` y asignándole un valor. Usa `if (number > 0)` para verificar si el número es positivo.
zh: 先声明一个变量 `number` 并赋值。 使用 `if (number > 0)` 检查数字是否为正数。

# exercise38Hint2Title
source: Hint 2
es: Pista 2
zh: 提示 2

# exercise38Hint2Content
source: Add an `else if (number < 0)` condition to check if the number is negative.
es: Agrega una condición `else if (number < 0)` para verificar si el número es negativo.
zh: 添加一个条件 `else if (number < 0)` 来检查数字是否为负数。

# exercise38SolutionTitle
source: Solution
es: Solución
zh: 解决方案

# exercise38SolutionContent
source: The correct solution is: ```swift var number = 5; if (number > 0) # print("Positive"); º else if (number < 0) # print("Negative"); º else # print("Zero"); º```
es: La solución correcta es: ```swift var number = 5; if (number > 0) # print("Positivo"); º else if (number < 0) # print("Negativo"); º else # print("Cero"); º```
zh: 正确的解决方案是： ```swift var number = 5; if (number > 0) # print("正数"); º else if (number < 0) # print("负数"); º else # print("零"); º```

# exercise38Example
source: Example: ```swift var number = 5; if (number > 0) # print("Positive"); º else if (number < 0) # print("Negative"); º else # print("Zero"); º```
es: Ejemplo: ```swift var number = 5; if (number > 0) # print("Positivo"); º else if (number < 0) # print("Negativo"); º else # print("Cero"); º```
zh: 示例： ```swift var number = 5; if (number > 0) # print("正数"); º else if (number < 0) # print("负数"); º else # print("零"); º```

# exercise38Hint
source: Enter your code here
es: Ingresa tu código aquí
zh: 在此输入你的代码

# exercise39IntroTitle
source: Exercise Instructions
es: Instrucciones del ejercicio
zh: 练习说明

# exercise39IntroContent
source: Welcome to Nested If-Else Challenge! 🎉 Your task is to determine the type of bonus an employee receives: 1. Declare variables `yearsOfService` (integer) and `performanceRating` (integer). 2. Use a nested `if-else` structure: - `High Bonus`: `yearsOfService >= 10` and `performanceRating >= 8`. - `Moderate Bonus`: `yearsOfService >= 10` but `performanceRating < 8`. - `Minimal Bonus`: `yearsOfService < 10`. 3. Print the type of bonus.
es: ¡Bienvenido al desafío de If-Else anidado! 🎉 Tu tarea es determinar el tipo de bono que recibe un empleado: 1. Declara las variables `yearsOfService` (entero) y `performanceRating` (entero). 2. Usa una estructura `if-else` anidada: - `Alto Bono`: `yearsOfService >= 10` y `performanceRating >= 8`. - `Bono Moderado`: `yearsOfService >= 10` pero `performanceRating < 8`. - `Bono Mínimo`: `yearsOfService < 10`. 3. Imprime el tipo de bono.
zh: 欢迎来到 If-Else 嵌套挑战！🎉 你的任务是确定员工可以获得的奖金类型： 1. 声明变量 `yearsOfService`（整数）和 `performanceRating`（整数）。 2. 使用嵌套的 `if-else` 结构： - `高奖金`：`yearsOfService >= 10` 且 `performanceRating >= 8`。 - `中等奖金`：`yearsOfService >= 10` 且 `performanceRating < 8`。 - `最低奖金`：`yearsOfService < 10`。 3. 打印相应的奖金类型。

# exercise39CorrectTitle
source: Correct! 🎉
es: ¡Correcto! 🎉
zh: 正确！🎉

# exercise39CorrectContent
source: Great job! You''ve implemented a nested `if-else` logic to determine employee bonuses. **Explanation:** - Employees with `yearsOfService >= 10` and `performanceRating >= 8` receive a `High Bonus`. - Employees with `yearsOfService >= 10` but `performanceRating < 8` receive a `Moderate Bonus`. - Employees with `yearsOfService < 10` receive a `Minimal Bonus`. This exercise helps you understand nested conditions and decision-making in Swift.
es: ¡Buen trabajo! Has implementado correctamente una lógica `if-else` anidada para determinar los bonos de los empleados. **Explicación:** - Empleados con `yearsOfService >= 10` y `performanceRating >= 8` reciben un `Alto Bono`. - Empleados con `yearsOfService >= 10` pero `performanceRating < 8` reciben un `Bono Moderado`. - Empleados con `yearsOfService < 10` reciben un `Bono Mínimo`. Este ejercicio te ayuda a entender condiciones anidadas y toma de decisiones en Swift.
zh: 干得好！你已经正确实现了嵌套的 `if-else` 逻辑来确定员工的奖金。 **说明：** - 员工的 `yearsOfService >= 10` 且 `performanceRating >= 8` 时，可获得 `高奖金`。 - 员工的 `yearsOfService >= 10` 且 `performanceRating < 8` 时，可获得 `中等奖金`。 - 员工的 `yearsOfService < 10` 时，可获得 `最低奖金`。 通过此练习，你可以了解嵌套条件和 Swift 中的决策逻辑。

# exercise39Hint1Title
source: Hint 1
es: Pista 1
zh: 提示 1

# exercise39Hint1Content
source: Start by declaring variables: `yearsOfService` and `performanceRating` as integers.
es: Comienza declarando las variables: `yearsOfService` y `performanceRating` como enteros.
zh: 声明变量：将 `yearsOfService` 和 `performanceRating` 设置为整数。

# exercise39Hint2Title
source: Hint 2
es: Pista 2
zh: 提示 2

# exercise39Hint2Content
source: Use a nested `if-else` structure. Evaluate `yearsOfService` first, then `performanceRating`.
es: Usa una estructura `if-else` anidada. Evalúa primero `yearsOfService` y luego `performanceRating`.
zh: 使用嵌套的 `if-else` 结构。首先评估 `yearsOfService`，然后检查 `performanceRating`。

# exercise39SolutionTitle
source: Solution
es: Solución
zh: 解决方案

# exercise39SolutionContent
source: The correct solution is: ```swift var yearsOfService = 12; var performanceRating = 9; if yearsOfService >= 10 # if performanceRating >= 8 # print("High Bonus"); º else # print("Moderate Bonus"); º º else # print("Minimal Bonus"); º
es: La solución correcta es: ```swift var yearsOfService = 12; var performanceRating = 9; if yearsOfService >= 10 # if performanceRating >= 8 # print("Alto Bono"); º else # print("Bono Moderado"); º º else # print("Bono Mínimo"); º
zh: 正确的解决方案是： ```swift var yearsOfService = 12; var performanceRating = 9; if yearsOfService >= 10 # if performanceRating >= 8 # print("高奖金"); º else # print("中等奖金"); º º else # print("最低奖金"); º

# exercise39Example
source: Example: ```swift var yearsOfService = 12; var performanceRating = 9; if yearsOfService >= 10 # if performanceRating >= 8 # print("High Bonus"); º else # print("Moderate Bonus"); º º else # print("Minimal Bonus"); º
es: Ejemplo: ```swift var yearsOfService = 12; var performanceRating = 9; if yearsOfService >= 10 # if performanceRating >= 8 # print("Alto Bono"); º else # print("Bono Moderado"); º º else # print("Bono Mínimo"); º
zh: 示例： ```swift var yearsOfService = 12; var performanceRating = 9; if yearsOfService >= 10 # if performanceRating >= 8 # print("高奖金"); º else # print("中等奖金"); º º else # print("最低奖金"); º

# exercise39Hint
source: Enter your code here
es: Ingresa tu código aquí
zh: 在此输入你的代码

# exercise40IntroTitle
source: Exercise Instructions
es: Instrucciones del ejercicio
zh: 练习说明

# exercise40IntroContent
source: Your task is to implement a grading system: 1. Declare variables `score` (integer) and `participation` (boolean). 2. Use `if-else` conditions: - `A` for `score >= 90` and `participation == true`. - `B` for `score >= 80`. - `C` for `score >= 70`. - `D` for `score >= 60`. - `F` otherwise. 3. Print the grade.
es: Tu tarea es implementar un sistema de calificación: 1. Declara variables `score` (entero) y `participation` (booleano). 2. Usa condiciones `if-else`: - `A` para `score >= 90` y `participation == true`. - `B` para `score >= 80`. - `C` para `score >= 70`. - `D` para `score >= 60`. - `F` en caso contrario. 3. Imprime la calificación.
zh: 你的任务是实现一个评分系统： 1. 声明变量 `score`（整数）和 `participation`（布尔值）。 2. 使用 `if-else` 条件： - 如果 `score >= 90` 且 `participation == true`，打印 `A`。 - 如果 `score >= 80`，打印 `B`。 - 如果 `score >= 70`，打印 `C`。 - 如果 `score >= 60`，打印 `D`。 - 否则，打印 `F`。 3. 打印最终评分。

# exercise40CorrectTitle
source: Correct! 🎉
es: ¡Correcto! 🎉
zh: 正确！🎉

# exercise40CorrectContent
source: Well done! You''ve implemented a grading system with multiple conditions. **Explanation:** - `A` is assigned for `score >= 90` and `participation == true`. - Other scores are evaluated sequentially in descending order. This approach helps to make decisions with multiple criteria.
es: ¡Bien hecho! Has implementado un sistema de calificación con múltiples condiciones. **Explicación:** - Se asigna `A` para `score >= 90` y `participation == true`. - Otras calificaciones se evalúan secuencialmente en orden descendente. Este enfoque ayuda a tomar decisiones con múltiples criterios.
zh: 干得好！你已经实现了一个包含多个条件的评分系统。 **说明：** - 如果 `score >= 90` 且 `participation == true`，评分为 `A`。 - 其他评分按递减顺序逐步评估。 此方法有助于根据多个条件进行决策。

# exercise40Hint1Title
source: Hint 1
es: Pista 1
zh: 提示 1

# exercise40Hint1Content
source: Start by declaring variables: `score` (integer) and `participation` (boolean).
es: Comienza declarando las variables: `score` (entero) y `participation` (booleano).
zh: 开始声明变量：`score`（整数）和 `participation`（布尔值）。

# exercise40Hint2Title
source: Hint 2
es: Pista 2
zh: 提示 2

# exercise40Hint2Content
source: Use `if` for the highest condition: if score >= 90 && participation == true # ... º and `else if` for other ranges.
es: Usa `if` para la condición más alta: if score >= 90 && participation == true # ... º y `else if` para otros rangos.
zh: 使用 `if` 语句判断最高条件： if score >= 90 && participation == true # ... º 并使用 `else if` 来处理其他范围。

# exercise40SolutionTitle
source: Solution
es: Solución
zh: 解决方案

# exercise40SolutionContent
source: The correct solution is: ```swift var score = 85; var participation = true; if score >= 90 && participation == true # print("A"); º else if score >= 80 # print("B"); º else if score >= 70 # print("C"); º else if score >= 60 # print("D"); º else # print("F"); º ```
es: La solución correcta es: ```swift var score = 85; var participation = true; if score >= 90 && participation == true # print("A"); º else if score >= 80 # print("B"); º else if score >= 70 # print("C"); º else if score >= 60 # print("D"); º else # print("F"); º ```
zh: 正确的解决方案是： ```swift var score = 85; var participation = true; if score >= 90 && participation == true # print("A"); º else if score >= 80 # print("B"); º else if score >= 70 # print("C"); º else if score >= 60 # print("D"); º else # print("F"); º ```

# exercise40Example
source: Example: ```swift var score = 85; var participation = true; if score >= 90 && participation == true # print("A"); º else if score >= 80 # print("B"); º else if score >= 70 # print("C"); º else if score >= 60 # print("D"); º else # print("F"); º ```
es: Ejemplo: ```swift var score = 85; var participation = true; if score >= 90 && participation == true # print("A"); º else if score >= 80 # print("B"); º else if score >= 70 # print("C"); º else if score >= 60 # print("D"); º else # print("F"); º ```
zh: 示例： ```swift var score = 85; var participation = true; if score >= 90 && participation == true # print("A"); º else if score >= 80 # print("B"); º else if score >= 70 # print("C"); º else if score >= 60 # print("D"); º else # print("F"); º ```

# exercise40Hint
source: Enter your code here
es: Ingresa tu código aquí
zh: 在此输入你的代码

# exercise41IntroTitle
source: Exercise Instructions
es: Instrucciones del Ejercicio
zh: 练习说明

# exercise41IntroContent
source: Your task is to evaluate university admission: 1. `gpa` must be >= 3.5. 2. `hasRecommendation` must be `true`. 3. `isExtraCurricularActive` must be `true`. Print `Admitted` if all criteria are met. Otherwise, print `Not Admitted`.
es: Tu tarea es evaluar la admisión universitaria: 1. `gpa` debe ser >= 3.5. 2. `hasRecommendation` debe ser `true`. 3. `isExtraCurricularActive` debe ser `true`. Imprime `Admitted` si cumple todos los criterios. De lo contrario, imprime `Not Admitted`.
zh: 你的任务是评估大学录取： 1. `gpa` 必须 >= 3.5。 2. `hasRecommendation` 必须为 `true`。 3. `isExtraCurricularActive` 必须为 `true`。 如果符合所有条件，打印 `Admitted`。否则，打印 `Not Admitted`。

# exercise41CorrectTitle
source: Correct! 🎉
es: ¡Correcto! 🎉
zh: 正确！🎉

# exercise41CorrectContent
source: Well done! You''ve successfully implemented an admission evaluation system.
es: ¡Bien hecho! Has implementado exitosamente un sistema de evaluación de admisión.
zh: 干得好！你已经成功实现了一个录取评估系统。

# exercise41Hint1Title
source: Hint 1
es: Pista 1
zh: 提示 1

# exercise41Hint1Content
source: Declare variables: - `gpa` (e.g., `3.8`) - `hasRecommendation` (e.g., `true`) - `isExtraCurricularActive` (e.g., `true`).
es: Declara las variables: - `gpa` (por ejemplo, `3.8`) - `hasRecommendation` (por ejemplo, `true`) - `isExtraCurricularActive` (por ejemplo, `true`).
zh: 声明以下变量： - `gpa`（例如：`3.8`） - `hasRecommendation`（例如：`true`） - `isExtraCurricularActive`（例如：`true`）。

# exercise41Hint2Title
source: Hint 2
es: Pista 2
zh: 提示 2

# exercise41Hint2Content
source: Use `if` to evaluate conditions: if gpa >= 3.5 && hasRecommendation == true && isExtraCurricularActive == true # ... º
es: Usa `if` para evaluar las condiciones: if gpa >= 3.5 && hasRecommendation == true && isExtraCurricularActive == true # ... º
zh: 使用 `if` 来评估条件： if gpa >= 3.5 && hasRecommendation == true && isExtraCurricularActive == true # ... º

# exercise41SolutionTitle
source: Solution
es: Solución
zh: 解决方案

# exercise41Example
source: Example: ```swift var gpa = 3.8; var hasRecommendation = true; var isExtraCurricularActive = true; if gpa >= 3.5 && hasRecommendation == true && isExtraCurricularActive == true # print("Admitted"); º else # print("Not Admitted"); º ```
es: Ejemplo: ```swift var gpa = 3.8; var hasRecommendation = true; var isExtraCurricularActive = true; if gpa >= 3.5 && hasRecommendation == true && isExtraCurricularActive == true # print("Admitted"); º else # print("Not Admitted"); º ```
zh: 示例： ```swift var gpa = 3.8; var hasRecommendation = true; var isExtraCurricularActive = true; if gpa >= 3.5 && hasRecommendation == true && isExtraCurricularActive == true # print("Admitted"); º else # print("Not Admitted"); º ```

# exercise41Hint
source: Enter your code here
es: Escribe tu código aquí
zh: 在此输入你的代码

# exercise42IntroTitle
source: Exercise Instructions
es: Instrucciones del Ejercicio
zh: 练习说明

# exercise42IntroContent
source: Create a program to evaluate university admission based on: 1. `gpa` (e.g., `3.8`) must be >= 3.5. 2. `hasRecommendation` must be `true`. 3. `isExtraCurricularActive` must be `true`. If all criteria are met, print `Admitted`. Otherwise, print `Not Admitted`.
es: Crea un programa para evaluar la admisión universitaria basado en: 1. `gpa` (por ejemplo, `3.8`) debe ser >= 3.5. 2. `hasRecommendation` debe ser `true`. 3. `isExtraCurricularActive` debe ser `true`. Si se cumplen todos los criterios, imprime `Admitted`. De lo contrario, imprime `Not Admitted`.
zh: 创建一个程序来评估大学录取，基于以下条件： 1. `gpa`（例如：`3.8`）必须 >= 3.5。 2. `hasRecommendation` 必须为 `true`。 3. `isExtraCurricularActive` 必须为 `true`。 如果满足所有条件，打印 `Admitted`。否则，打印 `Not Admitted`。

# exercise42CorrectTitle
source: Correct! 🎉
es: ¡Correcto! 🎉
zh: 正确！🎉

# exercise42CorrectContent
source: Well done! You''ve created an admission evaluation system. **Explanation:** - `gpa >= 3.5` ensures academic eligibility. - `hasRecommendation` checks for recommendation letters. - `isExtraCurricularActive` ensures extracurricular participation. Only students meeting all these criteria are admitted.
es: ¡Bien hecho! Has creado un sistema de evaluación de admisión. **Explicación:** - `gpa >= 3.5` asegura la elegibilidad académica. - `hasRecommendation` verifica las cartas de recomendación. - `isExtraCurricularActive` asegura la participación extracurricular. Solo se admiten estudiantes que cumplan con todos estos criterios.
zh: 干得好！你已经创建了一个录取评估系统。 **说明：** - `gpa >= 3.5` 确保学术资格。 - `hasRecommendation` 验证推荐信。 - `isExtraCurricularActive` 确保课外活动参与。 只有符合所有条件的学生才能被录取。

# exercise42Hint1Title
source: Hint 1
es: Pista 1
zh: 提示 1

# exercise42Hint1Content
source: Start by declaring variables: - `var gpa = 3.8` - `var hasRecommendation = true` - `var isExtraCurricularActive = true`
es: Empieza declarando las variables: - `var gpa = 3.8` - `var hasRecommendation = true` - `var isExtraCurricularActive = true`
zh: 开始声明以下变量： - `var gpa = 3.8` - `var hasRecommendation = true` - `var isExtraCurricularActive = true`

# exercise42Hint2Title
source: Hint 2
es: Pista 2
zh: 提示 2

# exercise42Hint2Content
source: Use `if` to evaluate the conditions. Example: ```swift if gpa >= 3.5 && hasRecommendation == true && isExtraCurricularActive == true # print("Admitted"); º else # print("Not Admitted"); º ```
es: Usa `if` para evaluar las condiciones. Ejemplo: ```swift if gpa >= 3.5 && hasRecommendation == true && isExtraCurricularActive == true # print("Admitted"); º else # print("Not Admitted"); º ```
zh: 使用 `if` 来评估条件。例如： ```swift if gpa >= 3.5 && hasRecommendation == true && isExtraCurricularActive == true # print("Admitted"); º else # print("Not Admitted"); º ```

# exercise42SolutionTitle
source: Solution
es: Solución
zh: 解决方案
