Repository: jojoji54/learnSwift
Catalog: lib/l10n/app_*.arb
Languages: es, zh

# exercise29SolutionContent
source: The correct solution is: ```swift let secretBoolean = true; let userGuess = true; if (userGuess == secretBoolean) # print("You guessed it! 🎉"); º else # print("Wrong guess! Try again."); º ```
es: La solución correcta es: ```swift let secretBoolean = true; let userGuess = true; if (userGuess == secretBoolean) # print("¡Acertaste! 🎉"); º else # print("Respuesta incorrecta. Inténtalo de nuevo."); º ```
zh: 正确的解决方案： ```swift let secretBoolean = true; let userGuess = true; if (userGuess == secretBoolean) # print("正确！🎉"); º else # print("错误。请再试一次。"); º ```

# booleanLogicExplanation
source: Amazing! You''ve successfully used logical operators to evaluate conditions. Explanation: - `isUserLoggedIn` and `hasPremiumAccess` are boolean constants. - You used the `&&` (AND) operator to check if both are true. - Based on the evaluation, you printed the corresponding message.
es: ¡Increíble! Has utilizado operadores lógicos para evaluar condiciones con éxito. Explicación: - `isUserLoggedIn` y `hasPremiumAccess` son constantes booleanas. - Usaste el operador `&&` (AND) para verificar si ambas son verdaderas. - Según la evaluación, imprimiste el mensaje correspondiente.
zh: 太棒了！你已经成功使用逻辑运算符来评估条件。 说明： - `isUserLoggedIn` 和 `hasPremiumAccess` 是布尔常量。 - 使用运算符 `&&` (AND) 检查它们是否都为真。 - 根据评估结果打印相应的消息。

# hint1BooleanLogic
source: Use two constants `isUserLoggedIn` and `hasPremiumAccess` with boolean values. Check both conditions using the `&&` operator.
es: Usa dos constantes `isUserLoggedIn` y `hasPremiumAccess` con valores booleanos. Verifica ambas condiciones usando el operador `&&`.
zh: 使用两个布尔常量 `isUserLoggedIn` 和 `hasPremiumAccess`。 使用运算符 `&&` 检查两个条件。

# hint2BooleanLogic
source: A correct example is: ```swift let isUserLoggedIn = true; let hasPremiumAccess = false; if (isUserLoggedIn && hasPremiumAccess) # print("Access granted to premium feature!"); º else # print("Access denied. Please log in or upgrade."); º ```
es: Un ejemplo correcto es: ```swift let isUserLoggedIn = true; let hasPremiumAccess = false; if (isUserLoggedIn && hasPremiumAccess) # print("¡Acceso otorgado a la función premium!"); º else # print("Acceso denegado. Por favor inicia sesión o mejora tu cuenta."); º ```
zh: 一个正确的示例是： ```swift let isUserLoggedIn = true; let hasPremiumAccess = false; if (isUserLoggedIn && hasPremiumAccess) # print("已获得高级功能访问权限！"); º else # print("访问被拒绝。请登录或升级账户。"); º ```

# booleanLogicInstructions
source: Welcome to the Logical Operators Game! 🧠 Your task: 1. Declare two constants: `isUserLoggedIn` and `hasPremiumAccess`. 2. Use the `&&` operator to check if both conditions are true. 3. If true, print `Access granted to premium feature!`. 4. Otherwise, print `Access denied. Please log in or upgrade.`
es: ¡Bienvenido al Juego de Operadores Lógicos! 🧠 Tu tarea: 1. Declara dos constantes: `isUserLoggedIn` y `hasPremiumAccess`. 2. Usa el operador `&&` para verificar si ambas condiciones son verdaderas. 3. Si es así, imprime `¡Acceso otorgado a la función premium!`. 4. De lo contrario, imprime `Acceso denegado. Por favor inicia sesión o mejora tu cuenta.`
zh: 欢迎来到逻辑运算符游戏！🧠 你的任务： 1. 声明两个常量：`isUserLoggedIn` 和 `hasPremiumAccess`。 2. 使用运算符 `&&` 检查两个条件是否都为真。 3. 如果条件成立，打印 `已获得高级功能访问权限！`。 4. 否则，打印 `访问被拒绝。请登录或升级账户。`

# exercise30SolutionContent
source: The correct solution is: ```swift let isUserLoggedIn = true; let hasPremiumAccess = false; if (isUserLoggedIn && hasPremiumAccess) # print("Access granted to premium feature!"); º else # print("Access denied. Please log in or upgrade."); º ```
es: La solución correcta es: ```swift let isUserLoggedIn = true; let hasPremiumAccess = false; if (isUserLoggedIn && hasPremiumAccess) # print("¡Acceso otorgado a la función premium!"); º else # print("Acceso denegado. Por favor inicia sesión o mejora tu cuenta."); º ```
zh: 正确的解决方案： ```swift let isUserLoggedIn = true; let hasPremiumAccess = false; if (isUserLoggedIn && hasPremiumAccess) # print("已获得高级功能访问权限！"); º else # print("访问被拒绝。请登录或升级账户。"); º ```

# exercise31IntroTitle
source: Exercise Instructions
es: Instrucciones del Ejercicio
zh: 练习说明

# exercise31IntroContent
source: Welcome to If-Else Basics! 🎉 Your task: 1. Declare a variable `score` and assign it a value. 2. Use an `if` block to check a condition (e.g., if the score is greater than 70). 3. Print `Passed` if the condition is true; otherwise, print `Failed`.
es: ¡Bienvenido a los fundamentos de If-Else! 🎉 Tu tarea: 1. Declara una variable `score` y asígnale un valor. 2. Usa un bloque `if` para comprobar una condición (por ejemplo, si la puntuación es mayor a 70). 3. Imprime `Aprobado` si la condición es verdadera; de lo contrario, imprime `Reprobado`.
zh: 欢迎来到 If-Else 的基础！🎉 你的任务： 1. 声明一个变量 `score` 并赋值。 2. 使用一个 `if` 块检查条件（例如，如果分数大于 70）。 3. 如果条件为真，打印 `通过`；否则打印 `未通过`。

# exercise31CorrectTitle
source: Correct! 🎉
es: ¡Correcto! 🎉
zh: 正确！🎉

# exercise31CorrectContent
source: Great! You''ve successfully used an if-else statement in Swift. Explanation: - The `if` block runs when the condition is true. - The `else` block runs when the condition is false. This allows you to make decisions based on conditions in your code.
es: ¡Genial! Has usado correctamente una declaración if-else en Swift. Explicación: - El bloque `if` se ejecuta cuando la condición es verdadera. - El bloque `else` se ejecuta cuando la condición es falsa. Esto te permite tomar decisiones basadas en condiciones en tu código.
zh: 太棒了！你已经成功在 Swift 中使用了 if-else 声明。 说明： - 当条件为真时，执行 `if` 块。 - 当条件为假时，执行 `else` 块。 这允许你根据条件在代码中做出决策。

# exercise31Hint1Title
source: Hint 1
es: Pista 1
zh: 提示 1

# exercise31Hint1Content
source: Start by declaring a variable, e.g., `var score = 80`. Use an `if` block to check the value.
es: Comienza declarando una variable, por ejemplo, `var score = 80`. Usa un bloque `if` para comprobar el valor.
zh: 首先声明一个变量，例如：`var score = 80`。使用一个 `if` 块检查值。

# exercise31Hint2Title
source: Hint 2
es: Pista 2
zh: 提示 2

# exercise31Hint2Content
source: An example structure could be: ```swift if (score > 70) # print("Passed"); º else # print("Failed"); º```
es: Una estructura de ejemplo podría ser: ```swift if (score > 70) # print("Aprobado"); º else # print("Reprobado"); º```
zh: 一个示例结构可能是： ```swift if (score > 70) # print("通过"); º else # print("未通过"); º```

# exercise31SolutionTitle
source: Solution
es: Solución
zh: 解决方案

# exercise31SolutionContent
source: The correct solution is: ```swift var score = 80; if (score > 70) # print("Passed"); º else # print("Failed"); º```
es: La solución correcta es: ```swift var score = 80; if (score > 70) # print("Aprobado"); º else # print("Reprobado"); º```
zh: 正确的解决方案是： ```swift var score = 80; if (score > 70) # print("通过"); º else # print("未通过"); º```

# exercise31Example
source: Example: 1 var score = 80; 2 if (score > 70) # 3 print("Passed"); 4 º else # 5 print("Failed"); 6 º
es: Ejemplo: 1 var score = 80; 2 if (score > 70) # 3 print("Aprobado"); 4 º else # 5 print("Reprobado"); 6 º
zh: 示例： 1 var score = 80; 2 if (score > 70) # 3 print("通过"); 4 º else # 5 print("未通过"); 6 º

# exercise31Hint
source: Enter your code here
es: Ingresa tu código aquí
zh: 在此输入你的代码

# exercise32IntroTitle
source: Exercise Instructions
es: Instrucciones del Ejercicio
zh: 练习说明

# exercise32IntroContent
source: Welcome to If-Else with Multiple Conditions! 🎉 Your task: 1. Declare a variable `temperature` and assign it a value. 2. Use `if` to check if it's greater than or equal to 30 and print 'It''s hot'. 3. Use `else if` to check if it's less than 15 and print 'It''s cold'. 4. Use `else` to handle all other cases and print 'It''s warm'.
es: ¡Bienvenido a If-Else con Múltiples Condiciones! 🎉 Tu tarea: 1. Declara una variable `temperature` y asígnale un valor. 2. Usa `if` para verificar si es mayor o igual a 30 e imprime 'Hace calor'. 3. Usa `else if` para verificar si es menor de 15 e imprime 'Hace frío'. 4. Usa `else` para manejar todos los demás casos e imprime 'Hace templado'.
zh: 欢迎来到 If-Else 多条件判断！🎉 你的任务： 1. 声明一个变量 `temperature` 并赋值。 2. 使用 `if` 检查是否大于等于 30 并打印 '很热'。 3. 使用 `else if` 检查是否小于 15 并打印 '很冷'。 4. 使用 `else` 处理其他所有情况并打印 '温暖'。

# exercise32CorrectTitle
source: Correct! 🎉
es: ¡Correcto! 🎉
zh: 正确！🎉

# exercise32CorrectContent
source: Great! You''ve successfully used if-else with multiple conditions in Swift. Explanation: - `if` is used for the first condition. - `else if` allows for additional checks. - `else` handles all other cases. This structure is useful for checking multiple possibilities.
es: ¡Genial! Has usado correctamente if-else con múltiples condiciones en Swift. Explicación: - `if` se usa para la primera condición. - `else if` permite realizar comprobaciones adicionales. - `else` maneja todos los demás casos. Esta estructura es útil para comprobar múltiples posibilidades.
zh: 太棒了！你已经在 Swift 中正确使用了多条件的 if-else。 说明： - `if` 用于第一个条件。 - `else if` 用于附加检查。 - `else` 处理所有其他情况。 这种结构对于检查多种可能性非常有用。

# exercise32Hint1Title
source: Hint 1
es: Pista 1
zh: 提示 1

# exercise32Hint1Content
source: Start by declaring a variable, e.g., `var temperature = 25`. Use `if` to check its value.
es: Comienza declarando una variable, por ejemplo, `var temperature = 25`. Usa `if` para verificar su valor.
zh: 首先声明一个变量，例如：`var temperature = 25`。使用 `if` 检查它的值。

# exercise32Hint2Title
source: Hint 2
es: Pista 2
zh: 提示 2

# exercise32Hint2Content
source: An example structure could be: ```swift if (temperature >= 30) # print("it is hot"); º else if (temperature < 15) # print("it is cold"); º else # print("it is warm"); º```
es: Una estructura de ejemplo podría ser: ```swift if (temperature >= 30) # print("Hace calor"); º else if (temperature < 15) # print("Hace frío"); º else # print("Hace templado"); º```
zh: 一个示例结构可能是： ```swift if (temperature >= 30) # print("很热"); º else if (temperature < 15) # print("很冷"); º else # print("温暖"); º```

# exercise32SolutionTitle
source: Solution
es: Solución
zh: 解决方案

# exercise32SolutionContent
source: The correct solution is: ```swift var temperature = 25; if (temperature >= 30) # print("it is hot"); º else if (temperature < 15) # print("it is cold"); º else # print("it is warm"); º```
es: La solución correcta es: ```swift var temperature = 25; if (temperature >= 30) # print("Hace calor"); º else if (temperature < 15) # print("Hace frío"); º else # print("Hace templado"); º```
zh: 正确的解决方案是： ```swift var temperature = 25; if (temperature >= 30) # print("很热"); º else if (temperature < 15) # print("很冷"); º else # print("温暖"); º```

# exercise32Example
source: Example: 1 var temperature = 25; 2 if (temperature >= 30) # 3 print("it is hot"); 4 º else if (temperature < 15) # 5 print("it is cold"); 6 º else # 7 print("it is warm"); 8 º
es: Ejemplo: 1 var temperature = 25; 2 if (temperature >= 30) # 3 print("Hace calor"); 4 º else if (temperature < 15) # 5 print("Hace frío"); 6 º else # 7 print("Hace templado"); 8 º
zh: 示例： 1 var temperature = 25; 2 if (temperature >= 30) # 3 print("很热"); 4 º else if (temperature < 15) # 5 print("很冷"); 6 º else # 7 print("温暖"); 8 º

# exercise32Hint
source: Enter your code here
es: Ingresa tu código aquí
zh: 在此输入你的代码

# exercise33IntroTitle
source: Exercise Instructions
es: Instrucciones del Ejercicio
zh: 练习说明

# exercise33IntroContent
source: Welcome to If-Else with Equality Checks! 🎉 Your task: 1. Declare a variable `password` and assign it the value "swift". 2. Use an `if` statement to check if `password` equals "swift". 3. Print "Access granted" if true, or "Access denied" otherwise.
es: ¡Bienvenido a If-Else con Comparaciones de Igualdad! 🎉 Tu tarea: 1. Declara una variable `password` y asígnale el valor "swift". 2. Usa una declaración `if` para verificar si `password` es igual a "swift". 3. Imprime "Acceso concedido" si es verdadero, o "Acceso denegado" en caso contrario.
zh: 欢迎来到 If-Else 等值比较！🎉 你的任务： 1. 声明一个变量 `password` 并赋值为 "swift"。 2. 使用 `if` 判断 `password` 是否等于 "swift"。 3. 如果为真，打印 "访问已授权"；否则打印 "访问被拒绝"。

# exercise33CorrectTitle
source: Correct! 🎉
es: ¡Correcto! 🎉
zh: 正确！🎉

# exercise33CorrectContent
source: Great! You''ve successfully used if-else with equality checks in Swift. Explanation: - Use `==` to compare if two values are equal. - If they are equal, the `if` block executes. - Otherwise, the `else` block executes. This is essential for decision-making in programs.
es: ¡Genial! Has usado correctamente if-else con comparaciones de igualdad en Swift. Explicación: - Usa `==` para comparar si dos valores son iguales. - Si son iguales, se ejecuta el bloque `if`. - De lo contrario, se ejecuta el bloque `else`. Esto es esencial para la toma de decisiones en programas.
zh: 太棒了！你已经在 Swift 中正确使用了 if-else 的等值比较。 说明： - 使用 `==` 检查两个值是否相等。 - 如果相等，执行 `if` 块。 - 否则，执行 `else` 块。 这是程序中决策的关键技能。

# exercise33Hint1Title
source: Hint 1
es: Pista 1
zh: 提示 1

# exercise33Hint1Content
source: Start by declaring a variable, e.g., `var password = "swift"`. Then use an `if` statement to check if it equals "swift".
es: Comienza declarando una variable, por ejemplo, `var password = "swift"`. Luego usa una declaración `if` para verificar si es igual a "swift".
zh: 首先声明一个变量，例如：`var password = "swift"`。然后使用 `if` 检查是否等于 "swift"。

# exercise33Hint2Title
source: Hint 2
es: Pista 2
zh: 提示 2

# exercise33Hint2Content
source: Structure your code like this: ```swift if (password == "swift") # print("Access granted"); º else # print("Access denied"); º```
es: Estructura tu código así: ```swift if (password == "swift") # print("Acceso concedido"); º else # print("Acceso denegado"); º```
zh: 将代码结构化如下： ```swift if (password == "swift") # print("访问已授权"); º else # print("访问被拒绝"); º```

# exercise33SolutionTitle
source: Solution
es: Solución
zh: 解决方案

# exercise33SolutionContent
source: The correct solution is: ```swift var password = "swift"; if (password == "swift") # print("Access granted"); º else # print("Access denied"); º```
es: La solución correcta es: ```swift var password = "swift"; if (password == "swift") # print("Acceso concedido"); º else # print("Acceso denegado"); º```
zh: 正确的解决方案是： ```swift var password = "swift"; if (password == "swift") # print("访问已授权"); º else # print("访问被拒绝"); º```

# exercise33Example
source: Example: 1 var password = "swift"; 2 if (password == "swift") # 3 print("Access granted"); 4 º else # 5 print("Access denied"); 6 º
es: Ejemplo: 1 var password = "swift"; 2 if (password == "swift") # 3 print("Acceso concedido"); 4 º else # 5 print("Acceso denegado"); 6 º
zh: 示例： 1 var password = "swift"; 2 if (password == "swift") # 3 print("访问已授权"); 4 º else # 5 print("访问被拒绝"); 6 º

# exercise33Hint
source: Enter your code here
es: Ingresa tu código aquí
zh: 在此输入你的代码

# exercise34IntroTitle
source: Exercise Instructions
es: Instrucciones del Ejercicio
zh: 练习说明

# exercise34IntroContent
source: Welcome to If-Else with Comparison Operators! 🎉 Your task: 1. Declare a variable `age` and assign it a number. 2. Use an `if` statement to check if `age >= 18`. 3. Print "You are an adult" if true, or "You are underage" otherwise.
es: ¡Bienvenido a If-Else con Operadores de Comparación! 🎉 Tu tarea: 1. Declara una variable `age` y asígnale un número. 2. Usa una declaración `if` para verificar si `age >= 18`. 3. Imprime "Eres un adulto" si es verdadero, o "Eres menor de edad" en caso contrario.
zh: 欢迎来到 If-Else 与比较运算符！🎉 你的任务： 1. 声明一个变量 `age` 并赋值为一个数字。 2. 使用 `if` 判断 `age >= 18`。 3. 如果为真，打印 "你是成年人"；否则打印 "你是未成年人"。

# exercise34CorrectTitle
source: Correct! 🎉
es: ¡Correcto! 🎉
zh: 正确！🎉

# exercise34CorrectContent
source: Great! You''ve successfully used `if-else` with comparison operators. Explanation: - The `>=` operator checks if a value is greater than or equal to another. - This is useful for decision-making based on numeric comparisons.
es: ¡Genial! Has usado correctamente `if-else` con operadores de comparación. Explicación: - El operador `>=` verifica si un valor es mayor o igual a otro. - Esto es útil para la toma de decisiones basadas en comparaciones numéricas.
zh: 太棒了！你已经正确使用了带比较运算符的 `if-else`。 说明： - 运算符 `>=` 检查一个值是否大于或等于另一个值。 - 这在基于数字比较的决策中非常有用。

# exercise34Hint1Title
source: Hint 1
es: Pista 1
zh: 提示 1

# exercise34Hint1Content
source: Declare a variable `age` and assign it a number, e.g., `var age = 16`. Then use an `if` statement to check if `age >= 18`.
es: Declara una variable `age` y asígnale un número, por ejemplo, `var age = 16`. Luego usa una declaración `if` para verificar si `age >= 18`.
zh: 声明一个变量 `age` 并赋值为一个数字，例如：`var age = 16`。然后使用 `if` 判断 `age >= 18`。

# exercise34Hint2Title
source: Hint 2
es: Pista 2
zh: 提示 2

# exercise34Hint2Content
source: Structure your code like this: ```swift if (age >= 18) # print("You are an adult"); º else # print("You are underage"); º```
es: Estructura tu código así: ```swift if (age >= 18) # print("Eres un adulto"); º else # print("Eres menor de edad"); º```
zh: 将代码结构化如下： ```swift if (age >= 18) # print("你是成年人"); º else # print("你是未成年人"); º```

# exercise34SolutionTitle
source: Solution
es: Solución
zh: 解决方案

# exercise34SolutionContent
source: The correct solution is: ```swift var age = 16; if (age >= 18) # print("You are an adult"); º else # print("You are underage"); º```
es: La solución correcta es: ```swift var age = 16; if (age >= 18) # print("Eres un adulto"); º else # print("Eres menor de edad"); º```
zh: 正确的解决方案是： ```swift var age = 16; if (age >= 18) # print("你是成年人"); º else # print("你是未成年人"); º```

# exercise34Example
source: Example: 1 var age = 16; 2 if (age >= 18) # 3 print("You are an adult"); 4 º else # 5 print("You are underage"); 6 º
es: Ejemplo: 1 var age = 16; 2 if (age >= 18) # 3 print("Eres un adulto"); 4 º else # 5 print("Eres menor de edad"); 6 º
zh: 示例： 1 var age = 16; 2 if (age >= 18) # 3 print("你是成年人"); 4 º else # 5 print("你是未成年人"); 6 º

# exercise34Hint
source: Enter your code here
es: Ingresa tu código aquí
zh: 在此输入你的代码

# exercise35IntroTitle
source: Exercise Instructions
es: Instrucciones del Ejercicio
zh: 练习说明

# exercise35IntroContent
source: Welcome to Nested If-Else Basics! 🎉 Your task: 1. Declare a variable `score` and assign it a number. 2. Use `if-else` statements to determine: - `Excellent` for scores 90 and above. - `Pass` for scores 60 to 89. - `Fail` for scores below 60. 3. Print the corresponding grade.
es: ¡Bienvenido a la introducción de If-Else anidados! 🎉 Tu tarea: 1. Declara una variable `score` y asígnale un número. 2. Usa declaraciones `if-else` para determinar: - `Excelente` para puntuaciones de 90 o más. - `Aprobado` para puntuaciones de 60 a 89. - `Reprobado` para puntuaciones inferiores a 60. 3. Imprime la categoría correspondiente.
zh: 欢迎来到 If-Else 嵌套介绍！🎉 你的任务： 1. 声明一个变量 `score` 并赋值为一个数字。 2. 使用 `if-else` 判断： - `优秀` 对于分数为 90 或以上。 - `及格` 对于分数在 60 到 89 之间。 - `不及格` 对于分数低于 60。 3. 打印相应的类别。

# exercise35CorrectTitle
source: Correct! 🎉
es: ¡Correcto! 🎉
zh: 正确！🎉

# exercise35CorrectContent
source: Great! You''ve successfully used nested `if-else` statements. Explanation: - Nested `if-else` allows checking multiple conditions in sequence. - In this exercise, the program evaluates a score and determines the grade category.
es: ¡Genial! Has usado correctamente las declaraciones `if-else` anidadas. Explicación: - Las estructuras `if-else` anidadas permiten evaluar múltiples condiciones en secuencia. - En este ejercicio, el programa evalúa una puntuación y determina la categoría correspondiente.
zh: 太棒了！你已经正确使用了嵌套的 `if-else` 结构。 说明： - 嵌套的 `if-else` 结构允许按顺序评估多个条件。 - 在本练习中，程序评估分数并确定相应的类别。

# exercise35Hint1Title
source: Hint 1
es: Pista 1
zh: 提示 1

# exercise35Hint1Content
source: Start by declaring a variable `score` and assign it a value, e.g., `var score = 75`.
es: Empieza declarando una variable `score` y asígnale un valor, por ejemplo, `var score = 75`.
zh: 首先声明一个变量 `score` 并赋值，例如：`var score = 75`。

# exercise35Hint2Title
source: Hint 2
es: Pista 2
zh: 提示 2

# exercise35Hint2Content
source: Use nested `if-else` to check the score: ```swift if (score >= 90) # print("Excellent"); º else # if (score >= 60) # print("Pass"); º else # print("Fail"); º º```
es: Usa declaraciones `if-else` anidadas para verificar el puntaje: ```swift if (score >= 90) # print("Excelente"); º else # if (score >= 60) # print("Aprobado"); º else # print("Reprobado"); º º```
zh: 使用嵌套的 `if-else` 结构来检查分数： ```swift if (score >= 90) # print("优秀"); º else # if (score >= 60) # print("及格"); º else # print("不及格"); º º```

# exercise35SolutionTitle
source: Solution
es: Solución
zh: 解决方案

# exercise35SolutionContent
source: The correct solution is: ```swift var score = 75; if (score >= 90) # print("Excellent"); º else # if (score >= 60) # print("Pass"); º else # print("Fail"); º º```
es: La solución correcta es: ```swift var score = 75; if (score >= 90) # print("Excelente"); º else # if (score >= 60) # print("Aprobado"); º else # print("Reprobado"); º º```
zh: 正确的解决方案是： ```swift var score = 75; if (score >= 90) # print("优秀"); º else # if (score >= 60) # print("及格"); º else # print("不及格"); º º```

# exercise35Example
source: Example: 1 var score = 75; 2 if (score >= 90) # 3 print("Excellent"); 4 º else # 5 if (score >= 60) # 6 print("Pass"); 7 º else # 8 print("Fail"); 9 º 10 º
es: Ejemplo: 1 var score = 75; 2 if (score >= 90) # 3 print("Excelente"); 4 º else # 5 if (score >= 60) # 6 print("Aprobado"); 7 º else # 8 print("Reprobado"); 9 º 10 º
zh: 示例： 1 var score = 75; 2 if (score >= 90) # 3 print("优秀"); 4 º else # 5 if (score >= 60) # 6 print("及格"); 7 º else # 8 print("不及格"); 9 º 10 º

# exercise35Hint
source: Enter your code here
es: Ingresa tu código aquí
zh: 在此输入你的代码

# exercise36IntroTitle
source: Exercise Instructions
es: Instrucciones del Ejercicio
zh: 练习说明

# exercise36IntroContent
source: Welcome to If-Else with Strings! 🎉 Your task: 1. Declare a variable named `fruit` and assign it a string value. 2. Use `if` to check if the string matches a specific value, and print the result. 3. Use `else` to handle other cases. Example: ```swift var fruit = "apple"; if (fruit == "apple") # print("It''s an apple!"); º else # print("It''s not an apple!"); º```
es: ¡Bienvenido a If-Else con Strings! 🎉 Tu tarea: 1. Declara una variable llamada `fruit` y asígnale un valor de cadena. 2. Usa `if` para comprobar si la cadena coincide con un valor específico e imprime el resultado. 3. Usa `else` para manejar otros casos. Ejemplo: ```swift var fruit = "apple"; if (fruit == "apple") # print("Es una manzana!"); º else # print("No es una manzana!"); º```
zh: 欢迎来到 If-Else 和字符串比较！🎉 你的任务： 1. 声明一个名为 `fruit` 的变量并赋值为一个字符串。 2. 使用 `if` 检查字符串是否与某个值匹配，并打印结果。 3. 使用 `else` 处理其他情况。 示例： ```swift var fruit = "apple"; if (fruit == "apple") # print("这是一个苹果！"); º else # print("这不是一个苹果！"); º```

# exercise36CorrectTitle
source: Correct! 🎉
es: ¡Correcto! 🎉
zh: 正确！🎉

# exercise36CorrectContent
source: Great! You''ve successfully used `if-else` to evaluate string conditions. Explanation: - Strings can be compared using the `==` operator. - Use `if` to check if a string matches a specific value.
es: ¡Genial! Has usado correctamente `if-else` para evaluar condiciones de cadenas. Explicación: - Las cadenas se pueden comparar usando el operador `==`. - Usa `if` para verificar si una cadena coincide con un valor específico.
zh: 太棒了！你已经正确使用了 `if-else` 来评估字符串条件。 说明： - 可以使用运算符 `==` 比较字符串。 - 使用 `if` 来检查字符串是否与某个特定值匹配。

# exercise36Hint1Title
source: Hint 1
es: Pista 1
zh: 提示 1

# exercise36Hint1Content
source: Start by declaring a variable `fruit` and assigning it a string value, e.g., `var fruit = "apple"`.
es: Empieza declarando una variable `fruit` y asígnale un valor de cadena, por ejemplo, `var fruit = "apple"`.
zh: 先声明一个变量 `fruit` 并赋值为一个字符串，例如：`var fruit = "apple"`。

# exercise36Hint2Title
source: Hint 2
es: Pista 2
zh: 提示 2
