Repository: jojoji54/learnSwift
Catalog: lib/l10n/app_*.arb
Languages: es, zh

# exerciseInstructionsBooleanNegation
source: Welcome to Boolean Negation! 🎉 Your task: 1. Declare a boolean variable using the `var` keyword. 2. Declare another variable and assign it the negated value of the first variable. Example: ```swift var isSwiftFun = true var notSwiftFun = !isSwiftFun ```
es: ¡Bienvenido a la Negación Booleana! 🎉 Tu tarea: 1. Declara una variable booleana usando la palabra clave `var`. 2. Declara otra variable y asígnale el valor negado de la primera variable. Ejemplo: ```swift var isSwiftFun = true var notSwiftFun = !isSwiftFun ```
zh: 欢迎学习布尔取反！🎉 你的任务： 1. 使用 `var` 关键字声明一个布尔变量。 2. 声明另一个变量，并将第一个变量的取反值赋给它。 示例： ```swift var isSwiftFun = true var notSwiftFun = !isSwiftFun ```

# exercise21SolutionContent
source: The correct solution is: ```swift var isSwiftFun = true var notSwiftFun = !isSwiftFun ```
es: La solución correcta es: ```swift var isSwiftFun = true var notSwiftFun = !isSwiftFun ```
zh: 正确的解决方案： ```swift var isSwiftFun = true var notSwiftFun = !isSwiftFun ```

# booleanShortCircuitExplanation
source: Great! You''ve successfully worked with boolean short-circuit evaluation in Swift. Explanation: - The `||` operator evaluates to `true` if either condition is true, without evaluating the second condition if the first is true. - The `&&` operator evaluates to `true` only if both conditions are true.
es: ¡Genial! Has trabajado correctamente con la evaluación de cortocircuito booleana en Swift. Explicación: - El operador `||` evalúa como `true` si alguna de las condiciones es verdadera, sin evaluar la segunda si la primera ya es verdadera. - El operador `&&` evalúa como `true` solo si ambas condiciones son verdaderas.
zh: 太棒了！你已经成功完成了 Swift 中的布尔短路求值练习。 说明： - 运算符 `||` 如果第一个条件为 `true`，不会评估第二个条件。 - 运算符 `&&` 只有在两个条件都为 `true` 时才会返回 `true`。

# hint1BooleanShortCircuit
source: Try using the `||` operator for 'OR' and `&&` for 'AND'.
es: Intenta usar el operador `||` para 'OR' y `&&` para 'AND'.
zh: 尝试使用 `||` 运算符进行“或”操作，使用 `&&` 运算符进行“与”操作。

# hint2BooleanShortCircuit
source: Remember, `||` evaluates the first condition first, while `&&` requires both conditions to be true.
es: Recuerda que `||` evalúa la primera condición primero, mientras que `&&` requiere que ambas condiciones sean verdaderas.
zh: 记住：`||` 先评估第一个条件，而 `&&` 要两个条件都为真。

# exerciseInstructionsBooleanShortCircuit
source: Welcome to Boolean Short-Circuit Evaluation! 🎉 Your task: 1. Declare a variable using the `var` keyword. 2. Use `||` (OR) and `&&` (AND) operators to create a boolean expression. Example: ```swift var result = (true || false) && true ```
es: ¡Bienvenido a la Evaluación de Cortocircuito Booleana! 🎉 Tu tarea: 1. Declara una variable usando la palabra clave `var`. 2. Usa los operadores `||` (OR) y `&&` (AND) para crear una expresión booleana. Ejemplo: ```swift var result = (true || false) && true ```
zh: 欢迎学习布尔短路求值！🎉 你的任务： 1. 使用 `var` 关键字声明一个变量。 2. 使用 `||`（或）和 `&&`（与）运算符创建布尔表达式。 示例： ```swift var result = (true || false) && true ```

# exercise22SolutionContent
source: The correct solution is: ```swift var result = (true || false) && true ```
es: La solución correcta es: ```swift var result = (true || false) && true ```
zh: 正确的解决方案： ```swift var result = (true || false) && true ```

# ternaryOperatorExplanation
source: Great! You''ve successfully used the conditional ternary operator in Swift. Explanation: - The ternary operator `? :` allows you to choose between two values based on a condition. - Example: ```swift var message = (true ? "Swift is great!" : "Swift is okay") ``` Here, `message` will hold the value `Swift is great!` because the condition is `true`.
es: ¡Genial! Has usado correctamente el operador ternario condicional en Swift. Explicación: - El operador ternario `? :` te permite elegir entre dos valores según una condición. - Ejemplo: ```swift var message = (true ? "¡Swift es genial!" : "Swift está bien") ``` Aquí, `message` contendrá el valor "¡Swift es genial!" porque la condición es `true`.
zh: 太棒了！你正确使用了 Swift 中的三元条件运算符。 说明： - 三元运算符 `? :` 允许你根据条件选择两个值之一。 - 示例： ```swift var message = (true ? "Swift 很棒！" : "Swift 还可以") ``` 因为条件为 `true`，所以 `message` 的值为 "Swift 很棒！"。

# hint1TernaryOperator
source: Use the ternary operator `? :` to choose between two values based on a condition.
es: Usa el operador ternario `? :` para elegir entre dos valores según una condición.
zh: 使用三元运算符 `? :` 根据条件选择两个值之一。

# hint2TernaryOperator
source: A correct example is: ```swift var message = (true ? "Swift is great!" : "Swift is okay") ```
es: Un ejemplo correcto es: ```swift var message = (true ? "¡Swift es genial!" : "Swift está bien") ```
zh: 正确示例： ```swift var message = (true ? "Swift 很棒！" : "Swift 还可以") ```

# exerciseInstructionsTernaryOperator
source: Welcome to the Conditional Ternary Operator! 🎉 Your task: 1. Declare a variable using the `var` keyword. 2. Use the ternary operator `? :` to assign it a value based on a boolean condition. Example: ```swift var message = (true ? "Swift is great!" : "Swift is okay") ```
es: ¡Bienvenido al Operador Ternario Condicional! 🎉 Tu tarea: 1. Declara una variable usando la palabra clave `var`. 2. Usa el operador ternario `? :` para asignarle un valor según una condición booleana. Ejemplo: ```swift var message = (true ? "¡Swift es genial!" : "Swift está bien") ```
zh: 欢迎学习三元条件运算符！🎉 你的任务： 1. 使用 `var` 关键字声明一个变量。 2. 使用三元运算符 `? :` 根据布尔条件为变量赋值。 示例： ```swift var message = (true ? "Swift 很棒！" : "Swift 还可以") ```

# exercise23SolutionContent
source: The correct solution is: ```swift var message = (true ? "Swift is great!" : "Swift is okay") ```
es: La solución correcta es: ```swift var message = (true ? "¡Swift es genial!" : "Swift está bien") ```
zh: 正确的解决方案： ```swift var message = (true ? "Swift 很棒！" : "Swift 还可以") ```

# ifElseExplanation
source: Great! You''ve successfully used a boolean in an `if-else` statement. Explanation: - Boolean variables can be used in conditional statements to control program flow. - Example: ```swift var isLearningFun = true if isLearningFun @ print("Swift is awesome!") & else @ print("Keep trying!") & ```
es: ¡Genial! Has usado correctamente un booleano en una declaración `if-else`. Explicación: - Las variables booleanas se pueden usar en declaraciones condicionales para controlar el flujo del programa. - Ejemplo: ```swift var isLearningFun = true if isLearningFun @ print("¡Swift es increíble!") & else @ print("¡Sigue intentándolo!") & ```
zh: 太棒了！你正确使用了布尔值与 `if-else` 语句。 说明： - 布尔变量可用于条件语句以控制程序流。 - 示例： ```swift var isLearningFun = true if isLearningFun @ print("Swift 很棒！") & else @ print("继续努力！") & ```

# hint1IfElse
source: Declare a boolean variable using `var`. Use it in an `if-else` statement to control what gets printed.
es: Declara una variable booleana usando `var`. Úsala en una declaración `if-else` para controlar lo que se imprime.
zh: 使用 `var` 声明布尔变量。在 `if-else` 语句中使用它控制输出。

# hint2IfElse
source: A correct example is: ```swift var isLearningFun = true if isLearningFun @ print("Swift is awesome!") & else @ print("Keep trying!") & ```
es: Un ejemplo correcto es: ```swift var isLearningFun = true if isLearningFun @ print("¡Swift es increíble!") & else @ print("¡Sigue intentándolo!") & ```
zh: 正确示例： ```swift var isLearningFun = true if isLearningFun @ print("Swift 很棒！") & else @ print("继续努力！") & ```

# exerciseInstructionsIfElse
source: Welcome to Boolean in If-Else Statements! 🎉 Your task: 1. Declare a boolean variable using the `var` keyword. 2. Use an `if-else` statement to print one of two messages depending on the boolean''s value. Example: ```swift var isLearningFun = true if isLearningFun @ print("Swift is awesome!") & else @ print("Keep trying!") & ```
es: ¡Bienvenido a Booleanos en If-Else Statements! 🎉 Tu tarea: 1. Declara una variable booleana usando la palabra clave `var`. 2. Usa una declaración `if-else` para imprimir uno de los dos mensajes dependiendo del valor del booleano. Ejemplo: ```swift var isLearningFun = true if isLearningFun @ print("¡Swift es increíble!") & else @ print("¡Sigue intentándolo!") & ```
zh: 欢迎学习布尔值与 If-Else 语句！🎉 你的任务： 1. 使用 `var` 关键字声明一个布尔变量。 2. 使用 `if-else` 语句根据布尔值输出不同的消息。 示例： ```swift var isLearningFun = true if isLearningFun @ print("Swift 很棒！") & else @ print("继续努力！") & ```

# exercise24SolutionContent
source: The correct solution is: ```swift var isLearningFun = true if isLearningFun @ print("Swift is awesome!") & else @ print("Keep trying!") & ```
es: La solución correcta es: ```swift var isLearningFun = true if isLearningFun @ print("¡Swift es increíble!") & else @ print("¡Sigue intentándolo!") & ```
zh: 正确的解决方案： ```swift var isLearningFun = true if isLearningFun @ print("Swift 很棒！") & else @ print("继续努力！") & ```

# nestedIfExplanation
source: Great! You''ve successfully used nested `if` statements with booleans. Explanation: - This exercise demonstrates how to use nested `if` statements to handle multiple conditions. - Example: ```swift var firstCondition = true var secondCondition = false if firstCondition @ if secondCondition @ print("You nailed it!") & else @ print("Almost there!") & & else @ print("Try again!") & ```
es: ¡Genial! Has usado correctamente declaraciones `if` anidadas con booleanos. Explicación: - Este ejercicio demuestra cómo usar declaraciones `if` anidadas para manejar múltiples condiciones. - Ejemplo: ```swift var firstCondition = true var secondCondition = false if firstCondition @ if secondCondition @ print("¡Lo lograste!") & else @ print("¡Casi lo consigues!") & & else @ print("¡Inténtalo de nuevo!") & ```
zh: 太棒了！你正确使用了嵌套 `if` 语句与布尔值。 说明： - 本练习展示如何使用嵌套 `if` 语句处理多个条件。 - 示例： ```swift var firstCondition = true var secondCondition = false if firstCondition @ if secondCondition @ print("你成功了！") & else @ print("差一点成功！") & & else @ print("请再试一次！") & ```

# hint1NestedIf
source: Use the `var` keyword to declare two boolean variables. Use nested `if` statements to check each condition.
es: Usa la palabra clave `var` para declarar dos variables booleanas. Usa declaraciones `if` anidadas para verificar cada condición.
zh: 使用 `var` 声明两个布尔变量。使用嵌套的 `if` 语句检查条件。

# hint2NestedIf
source: A correct example is: ```swift var firstCondition = true var secondCondition = false if firstCondition @ if secondCondition @ print("You nailed it!") & else @ print("Almost there!") & & else @ print("Try again!") & ```
es: Un ejemplo correcto es: ```swift var firstCondition = true var secondCondition = false if firstCondition @ if secondCondition @ print("¡Lo lograste!") & else @ print("¡Casi lo consigues!") & & else @ print("¡Inténtalo de nuevo!") & ```
zh: 正确示例： ```swift var firstCondition = true var secondCondition = false if firstCondition @ if secondCondition @ print("你成功了！") & else @ print("差一点成功！") & & else @ print("请再试一次！") & ```

# exerciseInstructionsNestedIf
source: Welcome to Nested If Statements with Booleans! 🎉 Your task: 1. Declare two boolean variables using the `var` keyword. 2. Use nested `if` statements to check both conditions. Example: ```swift var firstCondition = true var secondCondition = false if firstCondition @ if secondCondition @ print("You nailed it!") & else @ print("Almost there!") & & else @ print("Try again!") & ```
es: ¡Bienvenido a Declaraciones If Anidadas con Booleanos! 🎉 Tu tarea: 1. Declara dos variables booleanas usando la palabra clave `var`. 2. Usa declaraciones `if` anidadas para verificar ambas condiciones. Ejemplo: ```swift var firstCondition = true var secondCondition = false if firstCondition @ if secondCondition @ print("¡Lo lograste!") & else @ print("¡Casi lo consigues!") & & else @ print("¡Inténtalo de nuevo!") & ```
zh: 欢迎学习嵌套 If 语句与布尔值！🎉 你的任务： 1. 使用 `var` 关键字声明两个布尔变量。 2. 使用嵌套的 `if` 语句检查两个条件。 示例： ```swift var firstCondition = true var secondCondition = false if firstCondition @ if secondCondition @ print("你成功了！") & else @ print("差一点成功！") & & else @ print("请再试一次！") & ```

# exercise25SolutionContent
source: The correct solution is: ```swift var firstCondition = true var secondCondition = false if firstCondition @ if secondCondition @ print("You nailed it!") & else @ print("Almost there!") & & else @ print("Try again!") & ```
es: La solución correcta es: ```swift var firstCondition = true var secondCondition = false if firstCondition @ if secondCondition @ print("¡Lo lograste!") & else @ print("¡Casi lo consigues!") & & else @ print("¡Inténtalo de nuevo!") & ```
zh: 正确的解决方案： ```swift var firstCondition = true var secondCondition = false if firstCondition @ if secondCondition @ print("你成功了！") & else @ print("差一点成功！") & & else @ print("请再试一次！") & ```

# passwordValidatorExplanation
source: Great! You''ve successfully created a password validator using booleans. Explanation: - This exercise combines string operations and boolean logic. - A strong password must: 1. Be at least 8 characters long. 2. Contain an `@` symbol. 3. Contain a `$` symbol. Example solution: ```swift var password = "@StrongPass$"; if password.contains("@") && password.contains("$") < print("Strong password!"); > else < print("Weak password."); >```
es: ¡Genial! Has creado un validador de contraseñas usando booleanos. Explicación: - Este ejercicio combina operaciones con cadenas y lógica booleana. - Una contraseña segura debe: 1. Tener al menos 8 caracteres. 2. Contener un símbolo `@`. 3. Contener un símbolo `$`. Ejemplo de solución: ```swift var password = "@StrongPass$"; if password.contains("@") && password.contains("$") < print("¡Contraseña segura!"); > else < print("Contraseña débil."); >```
zh: 太棒了！你已经成功使用布尔值创建了一个密码验证器。 说明： - 本练习结合了字符串操作和布尔逻辑。 - 一个安全的密码应满足以下条件： 1. 至少包含 8 个字符。 2. 包含符号 `@`。 3. 包含符号 `$`。 示例解决方案： var password = "@StrongPass$"; if password.contains("@") && password.contains("$") < print("密码安全！"); > else < print("密码不安全。"); >

# hint1PasswordValidator
source: Start by declaring a variable named `password` with a string value. Use `.contains` to check for `@` and `$` symbols.
es: Declara una variable llamada `password` con un valor de cadena. Usa `.contains` para comprobar los símbolos `@` y `$`.
zh: 声明一个名为 `password` 的变量，并赋予一个字符串值。使用 `.contains` 检查是否包含符号 `@` 和 `$`。

# hint2PasswordValidator
source: Combine conditions with the `&&` operator: Use `if password.contains("@") && password.contains("$")`.
es: Combina las condiciones con el operador `&&`: Usa `if password.contains("@") && password.contains("$")`.
zh: 使用 `&&` 运算符组合条件： 例如：`if password.contains("@") && password.contains("$")`。

# passwordValidatorInstructions
source: Welcome to the Password Validator Challenge! 🎉 Your task: 1. Declare a variable named `password` and assign it a string value. 2. Use `if` statements to check if the password contains: - At least 8 characters. - An `@` symbol. - A `$` symbol. 3. If the password meets all criteria, print `Strong password!`. Otherwise, print `Weak password.`.
es: ¡Bienvenido al Desafío de Validador de Contraseñas! 🎉 Tu tarea: 1. Declara una variable llamada `password` y asígnale un valor de cadena. 2. Usa declaraciones `if` para verificar si la contraseña contiene: - Al menos 8 caracteres. - Un símbolo `@`. - Un símbolo `$`. 3. Si la contraseña cumple con todos los criterios, imprime `¡Contraseña segura!`. Si no, imprime `Contraseña débil.`.
zh: 欢迎来到密码验证挑战！🎉 你的任务： 1. 声明一个名为 `password` 的变量，并赋予一个字符串值。 2. 使用 `if` 语句检查密码是否： - 至少包含 8 个字符。 - 包含符号 `@`。 - 包含符号 `$`。 3. 如果密码符合所有条件，打印 `密码安全！`。否则，打印 `密码不安全。`。

# exercise26SolutionContent
source: The correct solution is: ```swift var password = "@StrongPass$"; if password.contains("@") && password.contains("$") < print("Strong password!"); > else < print("Weak password."); >```
es: La solución correcta es: ```swift var password = "@StrongPass$"; if password.contains("@") && password.contains("$") < print("¡Contraseña segura!"); > else < print("Contraseña débil."); >```
zh: 正确的解决方案： var password = "@StrongPass$"; if password.contains("@") && password.contains("$") < print("密码安全！"); > else < print("密码不安全。"); >

# gameLogicExplanation
source: Great! You''ve successfully implemented a game logic using booleans and conditions. Explanation: - You declared variables `isAlive` and `health`. - Used a constant `damage` to subtract health. - Checked if health was below or equal to 0 to determine if the game is over.
es: ¡Genial! Has implementado correctamente una lógica de juego usando booleanos y condiciones. Explicación: - Declaraste las variables `isAlive` y `health`. - Usaste una constante `damage` para restar a la salud. - Comprobaste si la salud era menor o igual a 0 para determinar si el juego ha terminado.
zh: 太棒了！你已经成功实现了一个使用布尔值和条件的游戏逻辑。 说明： - 你声明了变量 `isAlive` 和 `health`。 - 使用了一个常量 `damage` 来减少健康值。 - 检查健康值是否小于或等于 0 来决定游戏是否结束。

# hint1GameLogic
source: Declare variables `isAlive`, `health`, and a constant `damage`. Use `if` to check health.
es: Declara las variables `isAlive`, `health` y una constante `damage`. Usa `if` para comprobar la salud.
zh: 声明变量 `isAlive`、`health` 和常量 `damage`。使用 `if` 检查健康值。

# hint2GameLogic
source: Remember to use: - `health -= damage` to subtract health. - `if (health <= 0)` to check game over conditions.
es: Recuerda usar: - `health -= damage` para restar salud. - `if (health <= 0)` para comprobar las condiciones de fin de juego.
zh: 记住使用： - `health -= damage` 来减少健康值。 - `if (health <= 0)` 检查游戏结束条件。

# gameLogicInstructions
source: Welcome to the Boolean Game Logic Challenge! 🎮 Your task: 1. Declare `isAlive` as `true`. 2. Declare `health` as `100`. 3. Subtract `damage` from `health`. 4. Print `Game Over` if health <= 0. Otherwise, print `Keep Playing!`. Example: var isAlive = true; var health = 100; let damage = 30; health -= damage; if (health <= 0) # print("Game Over"); ª else # print("Keep Playing!"); ª
es: ¡Bienvenido al Desafío de Lógica de Juego con Booleanos! 🎮 Tu tarea: 1. Declara `isAlive` como `true`. 2. Declara `health` como `100`. 3. Resta `damage` a `health`. 4. Imprime `Game Over` si `health <= 0`. Si no, imprime `Keep Playing!`. Ejemplo: var isAlive = true; var health = 100; let damage = 30; health -= damage; if (health <= 0) # print("Game Over"); º else # print("Keep Playing!"); º
zh: 欢迎来到布尔值游戏逻辑挑战！🎮 你的任务： 1. 声明 `isAlive` 为 `true`。 2. 声明 `health` 为 `100`。 3. 从 `health` 中减去 `damage`。 4. 如果 `health <= 0`，打印 `Game Over`。否则，打印 `Keep Playing!`。 示例： var isAlive = true; var health = 100; let damage = 30; health -= damage; if (health <= 0) # print("Game Over"); º else # print("Keep Playing!"); º

# exercise27SolutionContent
source: The correct solution is: ```swift var isAlive = true; var health = 100; let damage = 30; health -= damage; if (health <= 0) # print("Game Over"); ª else # print("Keep Playing!"); ª ```
es: La solución correcta es: ```swift var isAlive = true; var health = 100; let damage = 30; health -= damage; if (health <= 0) # print("Game Over"); º else # print("Keep Playing!"); \n```
zh: 正确的解决方案： var isAlive = true; var health = 100; let damage = 30; health -= damage; if (health <= 0) # print("Game Over"); º else # print("Keep Playing!");

# quizLogicExplanation
source: Great! You''ve successfully implemented a quiz logic using booleans and conditions. Explanation: - `isAnswerCorrect` is a boolean constant that stores the user''s response. - An `if` condition checks its value and displays the appropriate message.
es: ¡Genial! Has implementado correctamente una lógica de cuestionario usando booleanos y condiciones. Explicación: - `isAnswerCorrect` es una constante booleana que almacena la respuesta del usuario. - Una condición `if` verifica su valor y muestra el mensaje correspondiente.
zh: 太棒了！你已经成功实现了一个使用布尔值和条件的测验逻辑。 说明： - `isAnswerCorrect` 是一个布尔常量，存储了用户的回答。 - 一个 `if` 条件语句检查其值并显示相应的消息。

# hint1QuizLogic
source: Use a boolean constant named `isAnswerCorrect`. Write an `if` condition to check its value.
es: Usa una constante booleana llamada `isAnswerCorrect`. Escribe una condición `if` para verificar su valor.
zh: 使用一个布尔常量 `isAnswerCorrect`。编写一个 `if` 条件语句来检查其值。

# hint2QuizLogic
source: A correct example is: ```swift let isAnswerCorrect = true; if (isAnswerCorrect) # print("Correct Answer! 🎉"); º else # print("Try Again!"); º ```
es: Un ejemplo correcto es: ```swift let isAnswerCorrect = true; if (isAnswerCorrect) # print("Correct Answer! 🎉"); º else # print("Try Again!"); º ```
zh: 一个正确的示例是： let isAnswerCorrect = true; if (isAnswerCorrect) # print("答案正确！🎉"); º else # print("再试一次！"); º

# quizLogicInstructions
source: Welcome to the Boolean Quiz App Logic Challenge! 🧠 Your task: 1. Declare `isAnswerCorrect` as a constant boolean. 2. Write an `if-else` structure to check if the answer is correct. 3. If correct, print `Correct Answer! 🎉`. Otherwise, print `Try Again!`.
es: ¡Bienvenido al Desafío de Lógica de Cuestionario! 🧠 Tu tarea: 1. Declara `isAnswerCorrect` como una constante booleana. 2. Escribe una estructura `if-else` para comprobar si la respuesta es correcta. 3. Si es correcta, imprime `Correct Answer! 🎉`. De lo contrario, imprime `Try Again!`.
zh: 欢迎来到测验逻辑挑战！🧠 你的任务： 1. 声明一个布尔常量 `isAnswerCorrect`。 2. 编写一个 `if-else` 结构来检查答案是否正确。 3. 如果正确，打印 `答案正确！🎉`。否则，打印 `再试一次！`。

# exercise28SolutionContent
source: The correct solution is: ```swift let isAnswerCorrect = true; if (isAnswerCorrect) # print("Correct Answer! 🎉"); º else # print("Try Again!"); º ```
es: La solución correcta es: ```swift let isAnswerCorrect = true; if (isAnswerCorrect) # print("Correct Answer! 🎉"); º else # print("Try Again!"); º ```
zh: 正确的解决方案： let isAnswerCorrect = true; if (isAnswerCorrect) # print("答案正确！🎉"); º else # print("再试一次！"); º

# booleanGuessExplanation
source: Amazing! You''ve implemented a guessing game using booleans. Explanation: - `secretBoolean` holds a hidden value. - The user compares their guess to this value using the `==` operator. - Based on the comparison, you display the appropriate message.
es: ¡Increíble! Has implementado un juego de adivinanzas utilizando booleanos. Explicación: - `secretBoolean` contiene un valor oculto. - El usuario compara su conjetura con este valor usando el operador `==`. - Basado en la comparación, se muestra el mensaje correspondiente.
zh: 太棒了！你已经成功实现了一个使用布尔值的猜谜游戏。 说明： - `secretBoolean` 包含一个隐藏值。 - 用户使用运算符 `==` 将自己的猜测与该值进行比较。 - 根据比较结果显示相应的消息。

# hint1BooleanGuess
source: Use a constant `secretBoolean` with a boolean value. Declare another constant `userGuess` and compare both using `==`.
es: Usa una constante `secretBoolean` con un valor booleano. Declara otra constante `userGuess` y compara ambas usando `==`.
zh: 使用一个布尔常量 `secretBoolean`。声明另一个常量 `userGuess`，并使用 `==` 比较两者。

# hint2BooleanGuess
source: A correct example is: ```swift let secretBoolean = true; let userGuess = true; if (userGuess == secretBoolean) # print("You guessed it! 🎉"); º else # print("Wrong guess! Try again."); º ```
es: Un ejemplo correcto es: ```swift let secretBoolean = true; let userGuess = true; if (userGuess == secretBoolean) # print("¡Acertaste! 🎉"); º else # print("Respuesta incorrecta. Inténtalo de nuevo."); º ```
zh: 一个正确的示例是： ```swift let secretBoolean = true; let userGuess = true; if (userGuess == secretBoolean) # print("正确！🎉"); º else # print("错误。请再试一次。"); º ```

# booleanGuessInstructions
source: Welcome to the Boolean Guessing Challenge! 🧠 Your task: 1. Declare a constant `secretBoolean` with a boolean value. 2. Declare a constant `userGuess` representing the user''s input. 3. Compare both using the `==` operator. 4. If the guess is correct, print `You guessed it! 🎉`. Otherwise, print `Wrong guess! Try again.`
es: ¡Bienvenido al Reto de Adivinanzas Booleanas! 🧠 Tu tarea: 1. Declara una constante `secretBoolean` con un valor booleano. 2. Declara una constante `userGuess` representando la entrada del usuario. 3. Compara ambas usando el operador `==`. 4. Si la conjetura es correcta, imprime `¡Acertaste! 🎉`. De lo contrario, imprime `Respuesta incorrecta. Inténtalo de nuevo.`
zh: 欢迎来到布尔猜谜挑战！🧠 你的任务： 1. 声明一个布尔常量 `secretBoolean`。 2. 声明一个表示用户输入的常量 `userGuess`。 3. 使用运算符 `==` 比较两者。 4. 如果猜测正确，打印 `正确！🎉`；否则，打印 `错误。请再试一次。`
